emacs-configuration.org
#+BRAIN_PARENTS: system
#+TITLE: Doom Emacs Configuration
#+PROPERTY: header-args :mkdirp yes
#+auto_tangle: nil

Doom is currently used because of its OOB vim focus and performance. Eventually I'd like to build a EFS config but that would consume a lot of time.

* Main doom config
:PROPERTIES:
:CREATED:  [2020-12-03 Thu 10:59]
:ID:       7f0433a1-486a-4042-976b-64ebc3a2abe4
:END:
Core files for a doom config. The installation script will identify these and install modules based on the init file.

** init
:PROPERTIES:
:CREATED:  [2020-12-03 Thu 11:16]
:ID:       c155e8b5-b80f-4dc2-864a-1c9a57c03608
:header-args: :noweb yes :tangle ~/.doom.d/init.el
:END:

Base packages with Doom defaults
#+begin_src elisp
  ;;; init.el -*- lexical-binding: t; -*-

  (doom! :input
         ;;chinese
         ;;japanese

         :completion
         company           ; the ultimate code completion backend
         helm              ; the *other* search engine for love and life
         ;;ido               ; the other *other* search engine...
         ivy               ; a search engine for love and life

         :desktop
         exwm
#+end_src

#+begin_src elisp
         :ui
         ;;deft              ; notational velocity for Emacs
         doom              ; what makes DOOM look the way it does
         doom-dashboard    ; a nifty splash screen for Emacs
         doom-quit         ; DOOM quit-message prompts when you quit Emacs
         ;;fill-column       ; a `fill-column' indicator
         hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
         hydra
         ;;indent-guides     ; highlighted indent columns
         modeline          ; snazzy, Atom-inspired modeline, plus API
         nav-flash         ; blink the current line after jumping
         ;;neotree           ; a project drawer, like NERDTree for vim
         ophints           ; highlight the region an operation acts on
         (popup
          +all
          +defaults)   ; tame sudden yet inevitable temporary windows
         (ligatures +extra)       ; replace bits of code with pretty symbols
         ;;tabs              ; an tab bar for Emacs
         treemacs          ; a project drawer, like neotree but cooler
         unicode           ; extended unicode support for various languages
         vc-gutter         ; vcs diff in the fringe
         vi-tilde-fringe   ; fringe tildes to mark beyond EOB
         window-select     ; visually switch windows
         workspaces        ; tab emulation, persistence & separate workspaces
         zen               ; distraction-free coding or writing
#+end_src

#+begin_src elisp
         :editor
         (evil +everywhere); come to the dark side, we have cookies
         file-templates    ; auto-snippets for empty files
         fold              ; (nigh) universal code folding
         (format +onsave)  ; automated prettiness
         ;;god               ; run Emacs commands without modifier keys
         ;;lispy             ; vim for lisp, for people who don't like vim
         ;;multiple-cursors  ; editing in many places at once
         ;;objed             ; text object editing for the innocent
         ;;parinfer          ; turn lisp into python, sort of
         ;;rotate-text       ; cycle region at point between text candidates
         snippets          ; my elves. They type so I don't have to
         word-wrap         ; soft wrapping with language-aware indent

         :emacs
         (dired +icons)    ; making dired pretty [functional]
         electric          ; smarter, keyword-based electric-indent
         undo              ; persistent, smarter undo for your inevitable mistakes
         ibuffer           ; interactive buffer management
         vc                ; version-control and Emacs, sitting in a tree

         :term
         eshell            ; a consistent, cross-platform shell (WIP)
         ;;shell             ; a terminal REPL for Emacs
         ;;term              ; terminals in Emacs
         vterm             ; another terminals in Emacs

         :checkers
         syntax              ; tasing you for every semicolon you forget
         (spell             ; tasing you for misspelling mispelling
         +aspell)
         grammar           ; tasing grammar mistake every you make

         :tools
         ;;ansible
         ;;debugger          ; FIXME stepping through code, to help you add bugs
         ;;direnv
         ;;docker
         editorconfig      ; let someone else argue about tabs vs spaces
         ;; ein               ; tame Jupyter notebooks with emacs
         (eval +overlay)     ; run code, run (also, repls)
         ;;gist              ; interacting with github gists
         (lookup              ; navigate your code and its documentation
          +dictionary
          +docsets)
         ;;lsp
         ;;macos             ; MacOS-specific commands
         (magit             ; a git porcelain for Emacs
          +forge)
         ;;make              ; run make tasks from Emacs
         pass              ; password manager for nerds
         pdf               ; pdf enhancements
         ;;prodigy           ; FIXME managing external services & code builders
         ;;rgb               ; creating color strings
         ;;terraform         ; infrastructure as code
         ;;tmux              ; an API for interacting with tmux
         ;;upload            ; map local to remote projects via ssh/ftp
#+end_src

#+begin_src elisp
         :lang
         ;;agda              ; types of types of types of types...
         ;;assembly          ; assembly for fun or debugging
         ;;cc                ; C/C++/Obj-C madness
         ;;clojure           ; java with a lisp
         common-lisp       ; if you've seen one lisp, you've seen them all
         ;;coq               ; proofs-as-programs
         ;;crystal           ; ruby at the speed of c
         csharp            ; unity, .NET, and mono shenanigans
         data              ; config/data formats
         ;;elixir            ; erlang done right
         ;;elm               ; care for a cup of TEA?
         emacs-lisp        ; drown in parentheses
         ;;erlang            ; an elegant language for a more civilized age
         ;;ess               ; emacs speaks statistics
         ;;faust             ; dsp, but you get to keep your soul
         ;;fsharp           ; ML stands for Microsoft's Language
         ;;fstar             ; (dependent) types and (monadic) effects and Z3
         ;;go                ; the hipster dialect
         ;;(haskell +dante)  ; a language that's lazier than I am
         ;;hy                ; readability of scheme w/ speed of python
         ;;idris             ;
         ;;(java +meghanada) ; the poster child for carpal tunnel syndrome
         ;;javascript        ; all(hope(abandon(ye(who(enter(here))))))
         ;;julia             ; a better, faster MATLAB
         ;;kotlin            ; a better, slicker Java(Script)
         latex             ; writing papers in Emacs has never been so fun
         ;;lean
         ;;factor
         ledger            ; an accounting system in Emacs
         lua               ; one-based indices? one-based indices
         markdown          ; writing docs for people to ignore
         ;;nim               ; python + lisp at the speed of c
         ;; nix               ; I hereby declare "nix geht mehr!"
         ;;ocaml             ; an objective camel
         (org              ; organize your plain life in plain text
          +brain           ; make your brain huge with org-mode
          +dragndrop       ; drag & drop files/images into org buffers
          ;;+hugo            ; use Emacs for hugo blogging
          +jupyter        ; ipython/jupyter support for babel
          +journal
          +pretty
          +noter           ; Keeps notes in sync with a document.
          +pandoc          ; export-with-pandoc support
          +pomodoro        ; be fruitful with the tomato technique
          +present)        ; using org-mode for presentations
          org-private
         ;;perl              ; write code no one else can comprehend
         ;;php               ; perl's insecure younger brother
         plantuml          ; diagrams for confusing people more
         ;;purescript        ; javascript, but functional
         python            ; beautiful is better than ugly
         ;;qt                ; the 'cutest' gui framework ever
         ;;racket            ; a DSL for DSLs
         ;;rest              ; Emacs as a REST client
         ;;rst               ; ReST in peace
         ;;(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
         ;;rust              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
         ;;scala             ; java, but good
         (scheme            ; a fully conniving family of lisps
         +guile)
         sh                ; she sells {ba,z,fi}sh shells on the C xor
         ;;solidity          ; do you need a blockchain? No.
         ;;swift             ; who asked for emoji variables?
         ;;terra             ; Earth and Moon in alignment for performance.
         web               ; the tubes
         yaml                         ; JSON, but readable

         :email
         (mu4e +gmail)
         ;;notmuch
         ;;(wanderlust +gmail)

         :app
         calendar
         ;;irc               ; how neckbeards socialize
         (rss +org)        ; emacs as an RSS reader
         ;;twitter           ; twitter client https://twitter.com/vnought

         :config
         ;;literate
         (default +bindings +smartparens))

#+end_src

