emacs-configuration.org
** packages
:PROPERTIES:
:CREATED:  [2020-12-03 Thu 11:16]
:ID:       784ab14a-2e81-4994-8427-992af538de14
:header-args: :tangle ~/.doom.d/packages.el
:END:

#+begin_src elisp
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;(package! builtin-package :recipe (:branch "develop"))
(package! openwith)
(package! pocket-reader)
(package! htmlize)
(package! w3m)
(package! focus)
(package! burly)
(package! undo-tree)
(package! helm-posframe)
(package! ivy-posframe)
(package! ranger)
(package! mpv)
(package! emms)
(package! polymode)
(package! tldr)
(package! guix)
;; (package! emms-helm)
;; (package! emms-org)
;; (package! emms-player-simple-mpv)
(package! subed :recipe
  (:host github
   :repo "rndusr/subed"
   :files ("subed/*.el")))
;; (package! emms-player-mpv-jp-radios)
;; (package! auth-pass)
#+end_src
** Variables
:PROPERTIES:
:CREATED:  [2020-08-15 Sat 12:52]
:ID:       9fb7cbb8-73e4-4cac-a829-eb5bc9027798
:END:

#+begin_src emacs-lisp :results silent
;; (auth-source-pass-entries)
(setq mail/personal (auth-source-pass-get "user" "email/personal/hotmail"))
#+end_src


* org
:PROPERTIES:
:CREATED:  [2020-09-29 Tue 14:43]
:ID:       c9b40e11-602f-413e-b3fa-133d964f5a6e
:header-args:elisp: :noweb yes :mkdirp yes
:END:
** org related packages
:PROPERTIES:
:CREATED:  [2020-11-16 Mon 18:45]
:ID:       440d64be-53c3-4a18-a170-690cbfbb8d6f
:END:

#+BEGIN_SRC elisp :noweb-ref org-packages :tangle ~/.doom.d/modules/lang/org-private/packages.el
;; -*- no-byte-compile: t; -*-
;;; desktop/lang/org-private/packages.el

;; (package! org-plus-contrib)
(package! org-brain :recipe
  (:host github
   :repo "Kungsgeten/org-brain"))
(package! org-auto-tangle :recipe
  (:host github
   :repo "yilkalargaw/org-auto-tangle"))
(package! org-ql)
(package! org-appear)
(package! org-download)
(package! org-web-tools)
(package! org-super-agenda)
(package! org-edna)
(package! org-superstar)
(package! org-pdftools)
(package! org-noter-pdftools)
(package! org-sidebar)
(package! org-sticky-header)
(package! org-media-note :recipe
  (:host github
   :repo "yuchen-lea/org-media-note"))
(package! org-expiry :recipe
  (:host github
   :repo "emacs-straight/org-mode"
   :files ("contrib/lisp/org-expiry.el")))
(package! org-pomodoro)
(package! toc-mode)
(package! persistent-scratch)
(package! org-ref)
(package! helm-bibtex)
(package! helm-lib-babel)
(package! powerthesaurus)
(package! ox-reveal)
(package! org-drill)
(package! org-cliplink)
(package! ascii-art-to-unicode)
(package! link-hint)
(package! major-mode-hydra)
(package! abridge-diff)
#+END_SRC

** PROJECT org ricing
:PROPERTIES:
:CREATED:  [2020-11-17 Tue 10:30]
:ID:       0af5adb9-5c1c-4899-bc92-22dd9c70b1f2
:END:

Let's start with fontification and other org ricing.
#+begin_src elisp :noweb-ref org-ricing
;;; lang/org-private/config.el -*- lexical-binding: t; -*-

;; org mode
(after! org
  :init
  (setq org-archive-location (concat org-directory "archive/archive.org::* From %s"))

  :config
  (setq org-superstar-headline-bullets-list '("› "))
  (setq org-fancy-priorities-mode nil) ;; needed for understanding fine-grained priority
  (setq org-startup-indented t
        org-clock-idle-time 5
        ;; org-bullets-bullet-list '("› ")
        org-ellipsis "  "
        org-pretty-entities t
        org-hide-emphasis-markers t
        org-agenda-block-separator ""
        org-fontify-whole-heading-line t
        org-fontify-done-headline t
        org-fontify-quote-and-verse-blocks t
        org-catch-invisible-edits 'show-and-error
        org-cycle-separator-lines 0
        org-tags-column -79
        org-modules '(org-habit
                      org-eshell
                      org-bookmark))
 ;; org-bibtex
 ;; org-docview
 ;; org-info
 (setq org-image-actual-width (/ (display-pixel-width) 3))

  (add-hook 'org-mode-hook (lambda ()
                             "Beautify Org Checkbox Symbol"
                             (push '("[ ]" .  "☐") prettify-symbols-alist)
                             (push '("[X]" . "☑" ) prettify-symbols-alist)
                             (push '("[-]" . "❍" ) prettify-symbols-alist)
                             (prettify-symbols-mode)))

  (add-hook! 'org-mode-hook #'doom-disable-line-numbers-h)

  (defface org-checkbox-done-text
    '((t (:foreground "#71696A")))
    "Face for the text part of a checked org-mode checkbox.")
  (add-to-list 'org-modules 'org-checklist)

  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-preceding-days 14
        ;; org-habit-following-days 1
        org-habit-graph-column 80
        org-habit-show-habits-only-for-today t
        ;; org-habit-show-all-today t)
        )

 (setq org-sticky-header-full-path 't)

  (setq org-todo-keyword-faces
        (quote (("TODO" :foreground "#ffb86c" :weight bold)
                ("NEXT" :foreground "#8be9fd" :weight bold)
                ("DONE" :foreground "#6272a4" :weight bold)
                ("IN-PROGRESS" :foreground "#50fa7b" :weight bold)
                ("PROJECT" :foreground "#0189cc" :weight bold)
                ("WAITING" :foreground "#f8f8f2" :weight bold)
                ("HOLD" :foreground "#a0522d" :weight bold)
                ("CANCELLED" :foreground "#ff5555" :weight bold)))))
#+end_src

*** TODO find where are org line numbers being disabled
:PROPERTIES:
:CREATED:  [2022-02-25 Fri 18:34]
:ID:       15c4b3a2-042f-4b99-aac8-2ff344378504
:END:
Line numbers just aren't as useful in org-mode files. For one, they are less often going to refer to positions of code, and because of folding indentation can get a bit long in the tooth, making visibility harder.
Also, it may make scrolling [[https://www.reddit.com/r/emacs/comments/gaub11/poor_scrolling_performance_in_doom_emacs/fp2v5jd/?utm_source=reddit&utm_medium=web2x&context=3][faster]].
#+begin_src elisp :tangle no
;; (setq org-mode-hook #'display-line-numbers-mode)
#+end_src

*** org-sticky-header
:PROPERTIES:
:CREATED:  [2021-09-23 Thu 10:53]
:ID:       c1be4df6-691a-44f6-ba79-43cb80e67107
:END:
Another alphapapa package, this is extremely useful for maintaining context when at some nth-level of indentation or visually distant from the last header text.
#+begin_src elisp
(use-package! org-sticky-header
  :hook (org-mode . org-sticky-header-mode)
  :config
  (setq org-sticky-header-full-path 'full
        org-sticky-header-outline-path-separator " › "))

#+end_src

