.doom.d/modules/lang/org-private/config.el
;;; lang/org-private/config.el -*- lexical-binding: t; -*-

;; org mode
(after! org
  :init
  (setq org-archive-location (concat org-directory "archive/archive.org::* From %s"))

  :config
  (setq org-superstar-headline-bullets-list '("› "))
  (setq org-fancy-priorities-mode nil) ;; needed for understanding fine-grained priority
  (setq org-startup-indented t
        org-clock-idle-time 5
        ;; org-bullets-bullet-list '("› ")
        org-ellipsis "  "
        org-pretty-entities t
        org-hide-emphasis-markers t
        org-agenda-block-separator ""
        org-fontify-whole-heading-line t
        org-fontify-done-headline t
        org-fontify-quote-and-verse-blocks t
        org-catch-invisible-edits 'show-and-error
        org-cycle-separator-lines 0
        org-tags-column -79
        org-modules '(org-habit
                      org-eshell
                      org-bookmark))
 ;; org-bibtex
 ;; org-docview
 ;; org-info
 (setq org-image-actual-width (/ (display-pixel-width) 3))

  (add-hook 'org-mode-hook (lambda ()
                             "Beautify Org Checkbox Symbol"
                             (push '("[ ]" .  "☐") prettify-symbols-alist)
                             (push '("[X]" . "☑" ) prettify-symbols-alist)
                             (push '("[-]" . "❍" ) prettify-symbols-alist)
                             (prettify-symbols-mode)))

  (add-hook! 'org-mode-hook #'doom-disable-line-numbers-h)

  (defface org-checkbox-done-text
    '((t (:foreground "#71696A")))
    "Face for the text part of a checked org-mode checkbox.")
  (add-to-list 'org-modules 'org-checklist)

  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-preceding-days 14
        ;; org-habit-following-days 1
        org-habit-graph-column 80
        org-habit-show-habits-only-for-today t
        ;; org-habit-show-all-today t)
        )

 (setq org-sticky-header-full-path 't)

  (setq org-todo-keyword-faces
        (quote (("TODO" :foreground "#ffb86c" :weight bold)
                ("NEXT" :foreground "#8be9fd" :weight bold)
                ("DONE" :foreground "#6272a4" :weight bold)
                ("IN-PROGRESS" :foreground "#50fa7b" :weight bold)
                ("PROJECT" :foreground "#0189cc" :weight bold)
                ("WAITING" :foreground "#f8f8f2" :weight bold)
                ("HOLD" :foreground "#a0522d" :weight bold)
                ("CANCELLED" :foreground "#ff5555" :weight bold)))))

(use-package! org-sticky-header
  :hook (org-mode . org-sticky-header-mode)
  :config
  (setq org-sticky-header-full-path 'full
        org-sticky-header-outline-path-separator " › "))

(use-package! org-appear
  :after org
  :config
  (add-hook 'org-mode-hook 'org-appear-mode)
  (setq org-appear-autolinks t))


(after! org
