emacs-configuration.org
** org-org
:PROPERTIES:
:CREATED:  [2020-11-17 Tue 10:30]
:ID:       a8f1f7b5-fdd0-4e5e-838c-302085174b0b
:END:

Next we'll build the organisational aspect of org-mode.
#+begin_src elisp :noweb-ref org-org
(after! org
(setq org-agenda-files "~/org/agenda.org")

;;TODO set refile to only projects?
  ;; Set refile targets
  (setq org-refile-use-outline-path 'file              ; Show full paths for refiling
        org-outline-path-complete-in-steps nil)        ; Refile in a single go
  (setq org-refile-allow-creating-parent-nodes 'confirm)
  (setq org-completion-use-ido nil)
  (setq org-refile-targets '(("~/org/next.org" :level . 0)
                             ("~/org/work.org" :maxlevel . 2)
                             ("~/org/personal.org" :maxlevel . 3)
                             ("~/org/wiki/thesis.org" :maxlevel . 3)
                             ("~/org/import.org" :maxlevel . 2)
                             ("~/org/incubation.org" :maxlevel . 1)
                             ("~/org/someday.org" :maxlevel . 2)
                             ("~/org/read.org" :maxlevel . 2)
                             ("~/org/watch.org" :maxlevel . 2)))

  ;; Org-contacts
  (setq org-contacts-files '("~/org/contacts.org"))

  (setq org-blank-before-new-entry '((heading . nil)))

  (setq org-startup-folded 'fold)
  (setq org-id-link-to-org-use-id 'use-existing)

  (setq org-enable-org-journal-support t)
  (setq org-journal-dir "~/org/journal/")

  ;; Link types for org-mode
  (setq org-file-apps
        '((auto-mode . emacs)
          ("\\.mpg\\'" . "mpv %s")))

  (setq org-image-actual-width '420)
  ;; org-todo keywords with interactivity
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "IN-PROGRESS(i)" "|" "DONE(d)")
          (type "PROJECT(p)" "|" "DONE(d!)")
          (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)")))

  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-log-state-notes-insert-after-drawers nil)

  ;; context tags
  (setq org-tag-alist '((:startgroup)
                            ;;; Contexts
                        ("@home" . ?h)
                        ;; ("@nathans" . ?n)
                        ;; ("@uni" . ?u)
                        ("@work" . ?u)
                        ("@errand" . ?e)
                        ("@shops" . ?s)
                        ("@onlineshop" . ?o)
                        ("@training" . ?T)
                        (:endgroup)
                        (:newline)
                            ;;; Tools
                        ("@phone" . ?p)
                        ("@computer" . ?c)
                        ;; ("@anywhere" . ?c)
                        (:newline)
                            ;;; Category
                        ("#email" . ?m)
                        ("#lowenergy" . ?l)
                        ("#translation" . ?t)
                        ("incremental" . ?t)
                        ;; ("web" . ?t)
                        ;; ("reading" . ?t)
                        (:newline)
                        ("WAITING" . ?W)
                        ("HOLD" . ?H)
                        ("CANCELLED" . ?C)
                        )))
#+end_src

??
#+begin_src elisp :noweb-ref org-org
#+end_src

** agenda and org-ql views
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 17:44]
:ID:       b35385d8-04fb-4b8a-a209-17050b650e3a
:END:

*** org-super-agenda
:PROPERTIES:
:CREATED:  [2022-02-26 Sat 11:34]
:ID:       d48e62f8-64e2-4d82-997b-09b474c0369c
:END:
Used for grouping recurrent areas of accountability/focus

#+begin_src elisp :noweb-ref org-org
(use-package! org-super-agenda
  ;; :commands (org-super-agenda-mode)
  ;; :init (advice-add #'org-super-agenda-mode :around #'doom-shut-up-a)
  :after org-agenda
  :init
  (setq org-super-agenda-groups
        `((:name "Schedule"
           :time-grid t)
          <<habits group>>
          (:name "Today"
           :time-grid t
           ;; :habit nil
           :discard (:header-regex "~/org/incubation.org"))
          (:name "Translation"
           :tag "#translation")
          (:name "Due today\n"
           :deadline today)
          (:name "Overdue"
           :deadline past)
          (:name "Due soon"
           :deadline future)
          (:name "Waiting\n"
           :todo "WAIT"
           :order 98)
          (:name "Scheduled earlier\n"
           :scheduled past)))
  :config
  (org-super-agenda-mode))

          #+end_src

Separate out incubated tasks into their own group:
          #+begin_src elisp :noweb-ref org-org
          (:name "Incubated - Hatched"
           ;; :scheduled today
           :discard (:not (:file-path "~/org/incubation.org")))
           ;; :file-path (,(concat org-directory "incubation.org")))
          #+end_src

          #+begin_src elisp :noweb-ref org-org
#+end_src

**** NEXT Setup org-super-agenda to split habits in seq order    :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       e4264554-7c6b-49e8-a38b-f27054fb861b
:TRIGGER:  chain-find-next(NEXT,from-current,priority-up,effort-down)
:END:
If I miss habits that occur later in the day, I don't want to have to reschedule them the next day so that they appear in order of when to do them.

#+begin_src elisp :noweb-ref habits group
(:name "Habits"
 :habit t)
#+end_src

