.doom.d/modules/lang/org-private/config.el
  (setq org-agenda-files "~/org/agenda.org")
  ;;TODO set refile to only projects?
  ;; Set refile targets
  (setq org-refile-use-outline-path 'file              ; Show full paths for refiling
        org-outline-path-complete-in-steps nil)        ; Refile in a single go
  (setq org-refile-allow-creating-parent-nodes 'confirm)
  (setq org-completion-use-ido nil)
  (setq org-refile-targets '(("~/org/next.org" :level . 0)
                             ("~/org/work.org" :maxlevel . 2)
                             ("~/org/personal.org" :maxlevel . 3)
                             ("~/org/wiki/thesis.org" :maxlevel . 3)
                             ("~/org/import.org" :maxlevel . 2)
                             ("~/org/incubation.org" :maxlevel . 1)
                             ("~/org/someday.org" :maxlevel . 2)
                             ("~/org/read.org" :maxlevel . 2)
                             ("~/org/watch.org" :maxlevel . 2)))

  ;; Org-contacts
  (setq org-contacts-files '("~/org/contacts.org"))

  (setq org-blank-before-new-entry '((heading . nil)))

  (setq org-startup-folded 'fold)
  (setq org-id-link-to-org-use-id 'use-existing)

  (setq org-enable-org-journal-support t)
  (setq org-journal-dir "~/org/journal/")

  ;; Link types for org-mode
  (setq org-file-apps
        '((auto-mode . emacs)
          ("\\.mpg\\'" . "mpv %s")))

  (setq org-image-actual-width '420)
  ;; org-todo keywords with interactivity
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "IN-PROGRESS(i)" "|" "DONE(d)")
          (type "PROJECT(p)" "|" "DONE(d!)")
          (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)")))

  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-log-state-notes-insert-after-drawers nil)

  ;; context tags
  (setq org-tag-alist '((:startgroup)
                            ;;; Contexts
                        ("@home" . ?h)
                        ;; ("@nathans" . ?n)
                        ;; ("@uni" . ?u)
                        ("@work" . ?u)
                        ("@errand" . ?e)
                        ("@shops" . ?s)
                        ("@onlineshop" . ?o)
                        ("@training" . ?T)
                        (:endgroup)
                        (:newline)
                            ;;; Tools
                        ("@phone" . ?p)
                        ("@computer" . ?c)
                        ;; ("@anywhere" . ?c)
                        (:newline)
                            ;;; Category
                        ("#email" . ?m)
                        ("#lowenergy" . ?l)
                        ("#translation" . ?t)
                        ("incremental" . ?t)
                        ;; ("web" . ?t)
                        ;; ("reading" . ?t)
                        (:newline)
                        ("WAITING" . ?W)
                        ("HOLD" . ?H)
                        ("CANCELLED" . ?C)
                        )))

(use-package! org-super-agenda
  ;; :commands (org-super-agenda-mode)
  ;; :init (advice-add #'org-super-agenda-mode :around #'doom-shut-up-a)
  :after org-agenda
  :init
  (setq org-super-agenda-groups
        `((:name "Schedule"
           :time-grid t)
          (:name "Habits"
           :habit t)
          (:name "Today"
           :time-grid t
           ;; :habit nil
           :discard (:header-regex "~/org/incubation.org"))
          (:name "Translation"
           :tag "#translation")
          (:name "Due today\n"
           :deadline today)
          (:name "Overdue"
           :deadline past)
          (:name "Due soon"
           :deadline future)
          (:name "Waiting\n"
           :todo "WAIT"
           :order 98)
          (:name "Scheduled earlier\n"
           :scheduled past)))
  :config
  (org-super-agenda-mode))

          (:name "Incubated - Hatched"
           ;; :scheduled today
           :discard (:not (:file-path "~/org/incubation.org")))
           ;; :file-path (,(concat org-directory "incubation.org")))
