.doom.d/modules/lang/org-private/config.el

(use-package! org-ql
  :after org)

(after! org-agenda
  (setq org-agenda-custom-commands
        '(("c" "At computer or laptop" tags-todo "@computer"
           ((org-agenda-overriding-header "@Computer Tasks")
            (org-agenda-skip-function
             '(org-agenda-skip-entry-if
               'todo '("PROJECT" "TODO" "WAITING" "DONE" "CANCELLED")))))
          ("e" "Emails to send" tags-todo "#email"
           ((org-agenda-overriding-header "Emails")
            (org-agenda-skip-function
             '(org-agenda-skip-entry-if
               'todo '("PROJECT" "TODO" "DONE" "CANCELLED")))))
          ("h" "Tasks around the house" tags-todo "@home"
           ((org-agenda-overriding-header "@Home Tasks")
            (org-agenda-skip-function
             '(org-agenda-skip-entry-if
               'todo '("PROJECT" "TODO" "WAITING" "DONE" "CANCELLED")))))
          ("t" "Translation (work) related tasks" tags-todo "#translation"
           ((org-agenda-overriding-header "Translation")
            (org-agenda-skip-function
             '(org-agenda-skip-entry-if
               'todo '("PROJECT" "TODO" "WAITING" "DONE" "CANCELLED")))))
          ("o" "Online shopping" tags-todo "@onlineshop"
           ((org-agenda-overriding-header "@Online Shops")
            (org-agenda-skip-function
             '(org-agenda-skip-entry-if
               'todo '("PROJECT" "TODO" "DONE" "CANCELLED")))))
          ("e" "Errands out and about" tags-todo "@errand"
           ((org-agenda-overriding-header "Errands")
            (org-agenda-skip-function
             '(org-agenda-skip-entry-if
               'todo '("PROJECT" "TODO" "WAITING" "DONE" "CANCELLED")))))
          ("l" "Low energy tasks" tags-todo "#lowenergy"
           ((org-agenda-overriding-header "Low Energy")
            (org-agenda-skip-function
             '(org-agenda-skip-entry-if
               'todo '("PROJECT" "TODO" "WAITING" "DONE" "CANCELLED")))))
          ;; HACK Attempt to emulate rudimentary Supermemo IR stack in org
          ("i" "Incremental Reading stack"
           ((org-ql-block '(todo "READING")
                          ((org-ql-block-header "Incremental Reading Stack")))))
          ("p" "Projects list"
           ((org-ql-block '(todo "PROJECT")
                          ((org-ql-block-header "Test PROJECT list")))))
          ;; From https://github.com/alphapapa/org-ql/blob/master/examples.org
          ("n" "All NEXT actions"
           ((org-ql-block '(todo "NEXT")
                          ((org-ql-block-header "Next actions list")))))
          ("s" "Stuck Projects"
           ((org-ql-block '(and (todo "PROJECT")
                                (not (done))
                                (not (descendants (todo "NEXT")))
                                (not (descendants (scheduled))))
                          ((org-ql-block-header "Suck Projects")))))
          ;; List tasks without "PROJECT" parent
          ("O" "Orphaned Tasks"
           ((org-ql-block '(and (todo)
                                (path "personal.org"
                                      "work.org"
                                      "wiki/thesis.org")
                                (not (todo "PROJECT"))
                                (not (ancestors (todo "PROJECT")))))
            ((org-ql-block-header "Orphaned Tasks")))))))
(defun my-open-calendar ()
  (interactive)
  (cfw:open-calendar-buffer
   :contents-sources
   (list
    (cfw:org-create-source "Green")  ; org-agenda source
    ;; (cfw:org-create-file-source "cal" "/path/to/cal.org" "Cyan")  ; other org source
    ;; (cfw:cal-create-source "Orange") ; diary source
    ;; (cfw:ical-create-source "Moon" "~/moon.ics" "Gray")  ; ICS source1
    ;; (cfw:ical-create-source "gcal" "https://..../basic.ics" "IndianRed") ; google calendar ICS
   )))

(use-package! org-depend
  :after org
  :config
(defun r-org/org-insert-trigger ()
  "Automatically insert chain-find-next trigger when entry becomes NEXT"
  (cond ((equal org-state "NEXT")
         (unless org-depend-doing-chain-find-next
           (org-set-property "TRIGGER" "chain-find-next(NEXT,from-current,priority-up,effort-down)")))
        ((equal org-state "IN-PROGRESS")
         (unless org-depend-doing-chain-find-next
           (org-set-property "TRIGGER" "chain-find-next(NEXT,from-current,priority-up,effort-down)")))
        ((equal org-state "WAITING")
         (unless org-depend-doing-chain-find-next
           (org-set-property "TRIGGER" "chain-find-next(NEXT,from-current,priority-up,effort-down)")))
        ((not (member org-state org-done-keywords))
         (org-delete-property "TRIGGER")))))

(add-hook 'org-after-todo-state-change-hook 'r-org/org-insert-trigger)

;; Capture
