emacs-configuration.org
** PROJECT Rework org-capture templates
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       1403291d-7ad9-4371-b4c3-ea67c7e2ac0c
:END:
;** org-capture

#+begin_src elisp :noweb-ref org-org
;; Capture
;; TODO Transfer captures to DOCT
(after! org-capture
  (add-hook 'org-capture-mode-hook 'evil-insert-state)

  ;; :ensure nil
  ;; :after org
  ;; :preface
  (defvar my/org-ledger-debitcard1-template "%(org-read-date) %^{Payee}
  Expenses:%^{Account}  $%^{Amount}
  Assets:Bank:Personal" "Template for personal debit card transactions with ledger.")

  (defvar my/org-ledger-debitcard2-template "%(org-read-date) %^{Payee}
  Expenses:%^{Account}  $%^{Amount}
  Assets:Bank:Business" "Template for business debit card transactions with ledger.")

  (defvar my/org-ledger-cash-template "%(org-read-date) * %^{Payee}
  Expenses:%^{Account}  $%^{Amount}
  Assets:Cash:Wallet" "Template for cash transaction with ledger.")

  (defvar my/org-ledger-creditcard-template "%(org-read-date) %^{Payee}
  Expenses:%^{Account}  $%^{Amount}
  Liabilities:Credits Cards:CWB" "Template for credit card transaction with ledger.")
  :custom
  (setq org-default-notes-file "inbox.org"
        org-capture-templates
        `(("t" "Todo [inbox]" entry (file+headline "~/org/inbox.org" "Tasks")
           "** TODO %i%?")
          ("e" "email" entry (file+headline "~/org/inbox.org" "Tasks")
           "** TODO [#A] %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
          ("e" "email" entry (file+headline "~/org/inbox.org" "Tasks")
           "** TODO [#A] %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
          ("c" "Contacts" entry (file "~/org/contacts.org")
           "** %(org-contacts-template-name)\n:PROPERTIES:\n:ROLE: %^{Role}\n:COMPANY: %^{Company}\n:EMAIL: %^(org-contacts-template-email)\n:CELL:%^{Cellphone}\n:PHONE:%^{Phone}\n:WEBSITE: %^{Website}\n:ADDRESS: %^{289 Cleveland St. Brooklyn, 11206 NY, USA}\n:NOTE: %^{NOTE} \n:END:")
          ;; Ledger
          ("l" "Ledger")
          ("lp" "Personal Bank" plain (file ,(format "~/Documents/ledger/ledger-%s.dat" (format-time-string "%Y"))),
           my/org-ledger-debitcard1-template
           :empty-lines 1
           :immediate-finish t)
          ("lb" "Business Bank" plain (file ,(format "~/Documents/ledger/ledger-%s.dat" (format-time-string "%Y"))),
           my/org-ledger-debitcard2-template
           :empty-lines 1
           :immediate-finish t)
          ("lc" "CWB Credit Card" plain (file ,(format "~/Documents/ledger/ledger-%s.dat" (format-time-string "%Y"))),
           my/org-ledger-creditcard-template
           :empty-lines 1
           :immediate-finish t)
          ("lw" "Cash" plain (file ,(format "~/Documents/ledger/ledger-%s.dat" (format-time-string "%Y"))),
           my/org-ledger-cash-template
           :empty-lines 1
           :immediate-finish t))))

#+end_src

*** NEXT Consider transferring captures to DOCT                   :@computer:
:PROPERTIES:
:TRIGGER:  chain-find-next(NEXT,from-current,priority-up,effort-down)
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       c716b6f8-d4b7-4250-b17e-dbb3436e4a44
:END:
https://github.com/progfolio/doct

*** TODO create capture template for books, movies etc.           :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       66744e54-1abe-44af-932a-3eedf749dd3a
:END:
('to watch' and 'to read')

*** TODO SM import capture template                               :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       c0e0c5e5-0790-4166-805d-14694f6b760a
:END:
*** TODO setup Org-capture for phone calls (enter into table?)    :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       b110a4b9-b971-4fa3-a354-cd5e17fcc665
:END:
This is to do with *IWTYTBR* methodology. Essentially whenever you get a call from the bank (or anyone) you should be capturing the person's name, time and duration of call etc.
*** TODO Prettify org-capture buffer                              :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       f1ef2aca-b552-4528-9508-03753c6fcc22
:END:
https://github.com/tecosaur/emacs-config/compare/6bcdbaa..49c790e

*** TODO Experiment with posframe capture                         :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       85a97d0d-6999-4730-b44f-6be1bcfbc007
:END:

*** Anki captures
:PROPERTIES:
:CREATED:  [2022-04-17 Sun 09:46]
:ID:       afd5119c-1fb7-4635-aa75-a3e35384e490
:END:
no longer needed
#+begin_src elisp :noweb no :tangle no
          ;; Anki
          ("a" "Anki")
          ("ab" "Anki basic"
           entry
           (file+headline org-my-anki-file "Dispatch Shelf")
           "* %<%H:%M>   %^g\n:PROPERTIES:\n:ANKI_NOTE_TYPE: Basic\n:ANKI_DECK: MegaDeck\n:END:\n** Front\n%?\n** Back\n%x\n")
          ("ac" "Anki cloze"
           entry
           (file+headline org-my-anki-file "Dispatch Shelf")
           "* %<%H:%M>   %^g\n:PROPERTIES:\n:ANKI_NOTE_TYPE: Cloze\n:ANKI_DECK: MegaDeck\n:END:\n** Text\n%x\n** Extra\n")
          ("ai" "Anki IR"
           entry
           (file+function "~/org/anki.org" key-to-header)
           "* %<%H:%M>   %^g\n:PROPERTIES:\n:ANKI_NOTE_TYPE: IR_Cloze\n:ANKI_DECK: MegaDeck\n:END:\n** Text\n%x\n** Extra \n\n** Cited \n** Link\n %(insert-property)  \n** Key\n %(insert-key)")
          ;; ("at" "Anki test"
          ;;  entry
          ;;  (file+function "~/org/anki.org" insert-key)
          ;;  "* %<%H:%M>   %^g\n:PROPERTIES:\n:ANKI_NOTE_TYPE: IR_Cloze\n:ANKI_DECK: MegaDeck\n:END:\n** Text\n%x ** Extra \n\n** Link\n %(insert-property)%")

#+end_src

** Presentation setup
:PROPERTIES:
:CREATED:  [2022-02-21 Mon 12:39]
:ID:       925c9cf3-b5cd-46fd-87dc-2dce196d210a
:END:
#+begin_src elisp :noweb-ref org-org :tangle no
(use-package! ox-reveal
  :config
  ;; TODO GUIX path?
  ;; (setq org-reveal-root "file:///home/volk/Templates/reveal.js"))
  (setq org-reveal-root (concat "file://" abbreviated-home-dir "/Templates/reveal.js")))
#+end_src

** PROJECT Setup org for effective GTD use (org-gtd)
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       676b0687-9e67-457f-9692-a762543cc475
:END:
*** TODO Look into tecosaur config                   :@computer:#incremental:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       cba6e4a3-8b50-44fa-af78-697c51f47562
:END:

https://tecosaur.github.io/emacs-config/config.html

*** TODO Add sounds back for org-pomodoro                         :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       45e748e0-a2f5-4cc4-965a-44fd9f4f4deb
:END:
*** TODO Encrypt org-journal                                      :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       a6bfc0c4-ce50-479c-a1a4-526991b8f757
:END:
*** TODO Link horizon 2 interests/areas to orgbrain               :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       af21e781-9b70-46d9-b5d4-12b0d1d82af7
:END:
*** TODO Make <enter> function for org-brain to helm-link :@computer:#lowenergy:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       af0cf7aa-ddfa-4379-a3cc-707bd1b2ea3d
:END:

Entering on a word brings up helm completion list based on word for other org-brain entities.


*** TODO Brainstorm: add completed tasks to journal entry for that day? :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       ec406bff-f6c0-43e4-8c73-902aaac16a4f
:END:
Maybe I should think about using transclusion
Wait org-ql blocks would be even better (have them render on open)

*** TODO Document GTD workflow in org-brain                       :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:08]
:ID:       b9847fd3-e6b2-4352-891a-a4b4b9ccc784
:END:

Use images and codeblocks
[[file:org/wiki/gtd.org][GTD and orgmode]]

** PROJECT Academic org
:PROPERTIES:
:CREATED:  [2020-11-17 Tue 10:30]
:ID:       57af6f09-ffc5-4227-86e2-a8f48b689e15
:END:
Here are academic/pdf related configs:

