.doom.d/modules/lang/org-private/config.el
;; TODO Transfer captures to DOCT
(after! org-capture
  (add-hook 'org-capture-mode-hook 'evil-insert-state)

  ;; :ensure nil
  ;; :after org
  ;; :preface
  (defvar my/org-ledger-debitcard1-template "%(org-read-date) %^{Payee}
  Expenses:%^{Account}  $%^{Amount}
  Assets:Bank:Personal" "Template for personal debit card transactions with ledger.")

  (defvar my/org-ledger-debitcard2-template "%(org-read-date) %^{Payee}
  Expenses:%^{Account}  $%^{Amount}
  Assets:Bank:Business" "Template for business debit card transactions with ledger.")

  (defvar my/org-ledger-cash-template "%(org-read-date) * %^{Payee}
  Expenses:%^{Account}  $%^{Amount}
  Assets:Cash:Wallet" "Template for cash transaction with ledger.")

  (defvar my/org-ledger-creditcard-template "%(org-read-date) %^{Payee}
  Expenses:%^{Account}  $%^{Amount}
  Liabilities:Credits Cards:CWB" "Template for credit card transaction with ledger.")
  :custom
  (setq org-default-notes-file "inbox.org"
        org-capture-templates
        `(("t" "Todo [inbox]" entry (file+headline "~/org/inbox.org" "Tasks")
           "** TODO %i%?")
          ("e" "email" entry (file+headline "~/org/inbox.org" "Tasks")
           "** TODO [#A] %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
          ("e" "email" entry (file+headline "~/org/inbox.org" "Tasks")
           "** TODO [#A] %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
          ("c" "Contacts" entry (file "~/org/contacts.org")
           "** %(org-contacts-template-name)\n:PROPERTIES:\n:ROLE: %^{Role}\n:COMPANY: %^{Company}\n:EMAIL: %^(org-contacts-template-email)\n:CELL:%^{Cellphone}\n:PHONE:%^{Phone}\n:WEBSITE: %^{Website}\n:ADDRESS: %^{289 Cleveland St. Brooklyn, 11206 NY, USA}\n:NOTE: %^{NOTE} \n:END:")
          ;; Ledger
          ("l" "Ledger")
          ("lp" "Personal Bank" plain (file ,(format "~/Documents/ledger/ledger-%s.dat" (format-time-string "%Y"))),
           my/org-ledger-debitcard1-template
           :empty-lines 1
           :immediate-finish t)
          ("lb" "Business Bank" plain (file ,(format "~/Documents/ledger/ledger-%s.dat" (format-time-string "%Y"))),
           my/org-ledger-debitcard2-template
           :empty-lines 1
           :immediate-finish t)
          ("lc" "CWB Credit Card" plain (file ,(format "~/Documents/ledger/ledger-%s.dat" (format-time-string "%Y"))),
           my/org-ledger-creditcard-template
           :empty-lines 1
           :immediate-finish t)
          ("lw" "Cash" plain (file ,(format "~/Documents/ledger/ledger-%s.dat" (format-time-string "%Y"))),
           my/org-ledger-cash-template
           :empty-lines 1
           :immediate-finish t))))

(use-package! ox-reveal
  :config
  ;; TODO GUIX path?
  ;; (setq org-reveal-root "file:///home/volk/Templates/reveal.js"))
  (setq org-reveal-root (concat "file://" abbreviated-home-dir "/Templates/reveal.js")))



;; PDF + synctex
(after! pdf-tools
