emacs-configuration.org
*** reference and writing tools
:PROPERTIES:
:CREATED:  [2020-12-10 Thu 10:35]
:ID:       7bf4ad4d-fc04-4783-9e93-cd423933babc
:END:

#+begin_src elisp :noweb-ref org-academic
;; PDF + synctex
(after! pdf-tools
  (setq TeX-view-program-selection '((output-pdf "PDF Tools"))
        TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
        TeX-source-correlate-start-server t)
  ;; This allows for opening in an indirect buffer
  (setq pdf-sync-backward-display-action t)
  (setq pdf-sync-forward-display-action t)
<<pdf outline numbering>>
  ;; to have the buffer refresh after compilation
  (add-hook 'TeX-after-compilation-finished-functions
            #'TeX-revert-document-buffer))

<<pdftools modeline hack>>
#+end_src

;; org-ref
(use-package! org-ref
  :config
  (setq reftex-default-bibliography "~/Documents/LaTeX/uni.bib"
        org-ref-default-bibliography '("~/Documents/LaTeX/uni.bib")
        org-ref-pdf-directory "~/Documents/PDF/"
        org-ref-bibliography-notes "~/org/org-brain/article-notes"
        bibtex-completion-bibliography "~/Documents/LaTeX/uni.bib"
        bibtex-completion-library-path "~/Documents/PDF"
        bibtex-completion-notes-path "~/org/org-brain/article-notes"
        bibtex-completion-pdf-symbol "⌘"
        bibtex-completion-notes-symbol "✎"
        bibtex-completion-additional-search-fields '(keywords)
;; I should improve the formatting of this:
        bibtex-completion-notes-template-one-file
        (format
         "\n* ${author}${year}\n  :PROPERTIES:\n  :Custom_ID: ${=key=}\n  :Keywords: ${keywords}\n  :YEAR: ${year}\n  :END:\n\n  - cite:${=key=}")
        doi-utils-open-pdf-after-download nil
        org-ref-note-title-format "* (%y) %t\n  :PROPERTIES:\n  :Custom_ID: %k\n  :AUTHOR: %9a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n  :END:")
        )
;; bib-library "~/Documents/LaTeX/uni.bib"
#+end_src

Automating export rules for org-files to LaTeX pdfs:
#+begin_src elisp :noweb-ref org-academic
(after! 'ox-latex
  :config
  (add-to-list 'org-latex-classes
               '("org-plain-latex"
                 "\\documentclass[12]{article}
        [NO-DEFAULT-PACKAGES]
        [PACKAGES]
        [EXTRA]"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

#+end_src

This is imported into the file (I should create more)
#+begin_src org :tangle ~/Documents/LaTeX/standard-export.org
,#+LATEX_CLASS: org-plain-latex

,#+LATEX_HEADER: \usepackage[backend=biber, style=apa]{biblatex}
,#+LATEX_HEADER: \usepackage{tocloft}
,#+LATEX_HEADER: \usepackage{hyperref}
,#+LATEX_HEADER: \usepackage{setspace}
,#+LATEX_HEADER: \usepackage[a4paper,% left=3cm,right=1cm]{geometry}
%% top=1in,bottom=1in,% footskip=.25in]
,#+LATEX_HEADER: \addbibresource{/home/nanjigen/Documents/LaTeX/uni.bib}
#+end_src

These export options are required for embedding ~lua~ code into ~latex~ snippets in org-mode blocks.
#+begin_src elisp :noweb-ref org-academic
(setq org-latex-pdf-process
  '("lualatex -shell-escape -interaction nonstopmode %f"
    "lualatex -shell-escape -interaction nonstopmode %f"))

(setq luamagick '(luamagick :programs ("lualatex" "convert")
       :description "pdf > png"
       :message "you need to install lualatex and imagemagick."
       :use-xcolor t
       :image-input-type "pdf"
       :image-output-type "png"
       :image-size-adjust (1.0 . 1.0)
       :latex-compiler ("lualatex -interaction nonstopmode -output-directory %o %f")
       :image-converter ("convert -density %D -trim -antialias %f -quality 100 %O")))

(add-to-list 'org-preview-latex-process-alist luamagick)

(setq org-preview-latex-default-process 'luamagick)

#+end_src

*** Linguistics related setup
:PROPERTIES:
:CREATED:  [2021-10-09 Sat 16:24]
:ID:       016014fd-9ba4-4ded-a2c7-a7929dea833e
:END:

Automated org-specific glossaries with [[https://gitlab.com/purlupar/org-expex][org-expex]]:
#+begin_src elisp :noweb-ref org-academic
;; (use-package! org-expex)

#+end_src

It's not actually built to ~provide~ which ~straight~ expects
#+begin_src elisp :noweb-ref org-packages :tangle ~/.doom.d/modules/lang/org-private/packages.el
(package! org-expex :recipe
  (:host gitlab
   :repo "purlupar/org-expex"))

#+end_src

