.doom.d/modules/lang/org-private/packages.el

(package! org-expex :recipe
  (:host gitlab
   :repo "purlupar/org-expex"))
