emacs-configuration.org
*** org-media-note                                                   :ATTACH:
:PROPERTIES:
:CREATED:  [2021-02-18 Thu 14:05]
:ID:       2986f9d8-8f09-40ed-a0a6-ce088d13325e
:HEADER-ARGS: :noweb yes
:END:

This handy package works with my ~Supermemo~ functions so that I can use incremental video note taking with org-mode from SM articles.

#+begin_src elisp :tangle ~/.doom.d/modules/lang/org-private/+org-media-note.el
;;; lang/org-private/+org-media-note.el -*- lexical-binding: t; -*-

(use-package! org-media-note
  :hook (org-mode . org-media-note-setup-org-ref)
  ;; :bind (("H-n" . org-media-note-hydra/body))  ;; Main entrance
  :config
  (setq bibtex-completion-pdf-field "file") ;; this is needed for local files stored in the bibkey entry, otherwise the path won't be found
  (setq org-media-note-screenshot-save-method 'attach)
  (setq org-media-note-use-refcite-first t)  ;; use videocite link instead of video link if possible

  <<org-media-note config>>

  <<org-media-note gif>>

  <<additional hydra functions>>

  <<modified org-media hydra>>

  )
#+end_src

TODO Make sure that the path is     ~
#+begin_src elisp :noweb-ref org-media-note gif
(defun nanjigen/org-media-note-insert-gif ()
  "Use giffer to generate a gif from mpv's loop
giffer's path is input-file output-file start-time end-time"
  (interactive)
  (let* ((input (shell-quote-argument (mpv-get-property "path")))
         (base-path (url-basepath (mpv-get-property "path")))
         (time-a (mpv-get-property "ab-loop-a"))
         (time-b (mpv-get-property "ab-loop-b"))
         (gif-file-name (org-media-note--format-file-name
                         (format "%sextract-%s-%s.gif" base-path time-a time-b)))
                        ;; (concat base-path "extract-"
                        ;;         time-a time-b ".gif")))
         (gif-target-path (cond
                             ((eq org-media-note-screenshot-save-method
                                  'attach)
                              (expand-file-name gif-file-name
                                                (org-attach-dir t)))
                             ((eq org-media-note-screenshot-save-method
                                  'directory)
                              (expand-file-name gif-file-name org-media-note-screenshot-image-dir)))))
    (shell-command (format "giffer %s %s %s %s" input gif-file-name time-a time-b))
    (insert (format "[[file:%s]] " gif-file-name)
    ;; (if (and (eq org-media-note-screenshot-save-method
    ;;              'attach)
    ;;          (eq org-media-note-screenshot-link-type-when-save-in-attach-dir
    ;;              'attach))
    ;;     (insert (format "[[attachment:%s]] "
    ;;                     (file-relative-name gif-target-path
    ;;                                         (org-attach-dir))))
    ;;   (insert (format "[[file:%s]] "
    ;;                   (org-media-note--format-file-path gif-target-path)
    ;;                   )))
    (org-media-note--display-inline-images))))
#+end_src

Use timestamp to name screenshot files instead of appended file paths (too long and breaks SM inline images!)
#+begin_src elisp :noweb no
(defun org-media-note-insert-screenshot ()
  "Insert current mpv screenshot into Org-mode note."
  (interactive)
  (let* ((image-file-name (org-media-note--format-picture-file-name (concat "screenshot-"
                                                                    (org-media-note--get-current-hms)
                                                                    ".jpg")))  ;; TODO let user customize this
         (image-target-path (cond
                             ((eq org-media-note-screenshot-save-method
                                  'attach)
                              (expand-file-name image-file-name
                                                (org-attach-dir t)))
                             ((eq org-media-note-screenshot-save-method
                                  'directory)
                              (expand-file-name image-file-name org-media-note-screenshot-image-dir)))))
    (if org-media-note-screenshot-with-sub
        (mpv-run-command "screenshot-to-file" image-target-path)
      (mpv-run-command "screenshot-to-file" image-target-path
                       "video"))
    (if (and (eq org-media-note-screenshot-save-method
                 'attach)
             (eq org-media-note-screenshot-link-type-when-save-in-attach-dir
                 'attach))
        (insert (format "[[attachment:%s]] "
                        (file-relative-name image-target-path
                                            (org-attach-dir))))
      (insert (format "[[file:%s]] "
                      (org-media-note--format-file-path image-target-path)
                      )))
    (org-media-note--display-inline-images)))
#+end_src

Additionally we can allow a more automated workflow for annotating screenshots in an external image manipulating tool:
#+begin_src elisp :noweb-ref image annotation
(defun nanjigen/org-link-file-path-at-point ()
  "Get the path of the file referred to by the link at point."
  (let* ((org-element (org-element-context))
         (is-subscript-p (equal (org-element-type org-element) 'subscript))
         (is-link-p (equal (org-element-type org-element) 'link))
         (is-file-p (equal (org-element-property :type org-element) "file")))
    (when is-subscript-p
      (user-error "Org thinks you're in a subscript. Move the point and try again."))
    (unless (and is-link-p is-file-p)
      (user-error "Not on file link"))
    (expand-file-name (org-element-property :path org-element))))

(defvar nanjigen/org-edit-image-redisplay-images t
  "Redisplay images after editing an image with `ll/org/edit-image'?")

(defun nanjigen/org-edit-image (&optional arg)
  "Edit the image linked at point. If
`ll/org/insert-screenshot/redisplay-images' is non-nil, redisplay
images in the current buffer."
  (interactive)
  (let ((img (nanjigen/org-link-file-path-at-point )))
    (start-process "gimp" nil "/usr/bin/gimp" img)
    (read-char "Editing image... Press any key when done.")
    (when nanjigen/org-edit-image-redisplay-images
      (org-remove-inline-images)
      (org-display-inline-images))))
#+end_src

**** TODO Add =org-media-note-hydra= features
:PROPERTIES:
:CREATED:  [2021-08-24 Tue 15:54]
:ID:       70d863c4-0725-4e6e-9d25-fe1ad8b0c12b
:END:
- Increment/decrement the a/b timestamp of a loop.
- Clear a/b loop and move to b position of loop and continue watching

Instead of creating a new ~pretty-hydra~, instead use the [[https://github.com/jerrypnz/major-mode-hydra.el#pretty-hydra-define-1][built-in]] =pretty-hydra-define+= for appending heads.
#+begin_src elisp :noweb-ref modified org-media hydra
(setq org-html-self-link-headlines t)

(pretty-hydra-define+ org-media-note-hydra ()
  ("File"
   (("f" org-media-note-toggle-mirror-view "Toggle mirror flip"))
   "Playback"
   (("," (mpv-seek-backward 1) "Back 1s")
    ("." (mpv-seek-forward 0.5) "Forward 1s"))
   "Toggle"
   (("t c" org-media-note-toggle-crop "Toggle mpv cropping"))))
#+end_src

#+begin_src elisp :noweb-ref additional hydra functions
(defcustom org-media-note-crop-p nil
  "When nil, allow cropping to start, otherwise stop cropping"
  :type 'boolean)

(defun org-media-note-toggle-crop ()
  "toggle cropping"
  (interactive)
  (if org-media-note-crop-p
      (progn
        (mpv-run-command "set" "fullscreen" "no")
        (mpv-run-command "vf" "del" "-1")
        (setq org-media-note-crop-p nil))
    (progn
      (mpv-run-command "set" "fullscreen" "yes")
      (mpv-run-command "script-message-to" "crop" "start-crop")
      (setq org-media-note-crop-p t))))
#+end_src

