emacs-configuration.org
*** org-brain
:PROPERTIES:
:CREATED:  [2020-12-10 Thu 16:00]
:ID:       e69debce-5954-4552-a8a6-3f9970fee70c
:header-args: :noweb-ref org-brain config
:END:

#+begin_src elisp
(use-package! polymode)

;; org-brain
(use-package! org-brain
  :defer t

  :init
  (setq org-brain-visualize-default-choices 'all
        org-brain-title-max-length 24
        org-brain-include-file-entries t
        org-brain-backlink t)
  (setq org-brain-path "~/org/org-brain")

  :config
  (add-hook 'org-brain-visualize-mode-hook #'org-brain-polymode)

  (set-popup-rule! "^\\*org-brain"
    :side 'right :size 1.00 :select t :ttl nil)

  (when (featurep! :editor evil +everywhere)
    ;; TODO Make a proper evil keybind scheme for org-brain
    ;; REVIEW This should be handled upstream by evil-collection
    (set-evil-initial-state!
      '(org-brain-visualize-mode
        org-brain-select-map
        org-brain-move-map
        org-brain-polymode-map)
      'normal)
    (defun +org--evilify-map (map)
      (let (keys)
        (map-keymap (lambda (event function)
                      (push function keys)
                      (push (vector event) keys))
                    map)
        (apply #'evil-define-key* 'normal map keys)))

    (+org--evilify-map org-brain-visualize-mode-map)
    (+org--evilify-map org-brain-select-map)
    (+org--evilify-map org-brain-move-map)
    (after! polymode
      (+org--evilify-map org-brain-polymode-map)))

  (defun +popup-toggle-brain ()
    (interactive)
    (let ((+popup--inhibit-transient t))
      (cond ((+popup-windows) (+popup/close-all t))
            ((display-buffer (get-buffer "*org-brain*"))))))

  (setq org-id-track-globally t
        org-id-locations-file "~/org/.org-id-locations")

  (add-hook 'before-save-hook #'org-brain-ensure-ids-in-buffer)
  (cl-pushnew '("b" "Brain" plain (function org-brain-goto-end)
                "* %i%?" :empty-lines 1)
              org-capture-templates
              :key #'car :test #'equal)
  ;; (define-key org-brain-visualize-mode-map (kbd "C-l") #'link-hint-open-link)
  (map! :map org-brain-visualize-mode-map "C-o" #'link-hint-open-link)

  (use-package! org-cliplink)
  (defun org-brain-cliplink-resource ()
    "Add a URL from the clipboard as an org-brain resource.
    Suggest the URL title as a description for resource."
    (interactive)
    (let ((url (org-cliplink-clipboard-content)))
      (org-brain-add-resource
       url
       (org-cliplink-retrieve-title-synchronously url)
       t)))

  (map! :map org-brain-visualize-mode-map "L" #'org-brain-cliplink-resource)
  (add-hook 'org-brain-after-visualize-hook #'visual-line-mode)
#+end_src

Some display mods
#+begin_src elisp
  ;; Prettier line drawing

  (defface aa2u-face '((t . nil))
    "Face for aa2u box drawing characters")
  (advice-add #'aa2u-1c :filter-return
              (lambda (str) (propertize str 'face 'aa2u-face)))
  (defun aa2u-org-brain-buffer ()
    (let ((inhibit-read-only t))
      (make-local-variable 'face-remapping-alist)
      (add-to-list 'face-remapping-alist
                   '(aa2u-face . org-brain-wires))
      (ignore-errors (aa2u (point-min) (point-max)))))
  (with-eval-after-load 'org-brain
    (add-hook 'org-brain-after-visualize-hook #'aa2u-org-brain-buffer))

#+end_src

Some iconification stolen from [[https://github.com/vedang/emacs-up/blob/f8635f3875704b5a1a3966f4fd8558d2b331d47c/el-get-init-files/init-org-brain.el#L97][here]]:
#+begin_src elisp
  (defun org-brain-insert-resource-icon (link)
    "Insert an icon, based on content of org-mode LINK."
    (insert (format "%s "
                    (cond ((string-prefix-p "brain:" link)
                           (all-the-icons-fileicon "brain"))
                          ((string-prefix-p "info:" link)
                           (all-the-icons-octicon "info"))
                          ((string-prefix-p "help:" link)
                           (all-the-icons-material "help"))
                          ((string-prefix-p "http" link)
                           (all-the-icons-icon-for-url link))
                          (t
                           (all-the-icons-icon-for-file link))))))

  (with-eval-after-load 'all-the-icons
    (add-hook 'org-brain-after-resource-button-functions
              'org-brain-insert-resource-icon))

#+end_src

#+begin_src elisp
  ;; Setup org-expiry and define a org-agenda function to compare timestamps
  (use-package! org-expiry
    :after org-brain
    :config
    (setq org-expiry-inactive-timestamps t)
    (defun org-expiry-created-comp (a b)
      "Compare `org-expiry-created-property-name' properties of A and B."
      (let ((ta (ignore-errors
                  (org-time-string-to-seconds
                   (org-entry-get (get-text-property 0 'org-marker a)
                                  org-expiry-created-property-name))))
            (tb (ignore-errors
                  (org-time-string-to-seconds
                   (org-entry-get (get-text-property 0 'org-marker b)
                                  org-expiry-created-property-name)))))
        (cond ((if ta (and tb (< ta tb)) tb) -1)
              ((if tb (and ta (< tb ta)) ta) +1))))

    ;; Add CREATED property when adding a new org-brain headline entry
    (add-hook 'org-brain-new-entry-hook #'org-expiry-insert-created)

    ;; Finally add a function which lets us watch the entries chronologically
    (defun org-brain-timeline ()
      "List all org-brain headlines in chronological order."
      (interactive)
      (let ((org-agenda-files (org-brain-files))
            (org-agenda-cmp-user-defined #'org-expiry-created-comp)
            (org-agenda-sorting-strategy '(user-defined-down)))
        (org-tags-view nil (format "+%s>\"\"" org-expiry-created-property-name))))))

#+end_src

