emacs-configuration.org
**** org-brain helm
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 17:49]
:ID:       a2bdf032-75f4-40ae-a05d-410ed5791142
:END:
A new =helm= for =org-brain=, =helm-org-brain=, which offers more features and easier configuration than the provided default.
Mainly, a Helm action that allows opening the current entry (or marked entries) in another visible window, bound to ~C-c o~ (much like the ~helm-buffer-switch-other-window~ action).
#+begin_src elisp
(after! org-brain
  :init

  (load! "+helm-org-brain")

  :config
;; (map! :map helm-org-brain-map
;;         "C-c o" #'helm-org-brain-switch-node-other-window)

  (map! :map org-mode-map
      ;; "C-c a"         #'org-agenda
       (:prefix ("C-c b" . "brain")
        "a"            #'org-brain-agenda
        "v"            #'org-brain-visualize)))

  #+end_src

#+begin_src elisp :tangle ~/.doom.d/modules/lang/org-private/+helm-org-brain.el :noweb-ref no
;;; lang/org-private/+helm-org-brain.el -*- lexical-binding: t; -*-

(defmacro helm-exit-and-run! (&rest body)
  "Define an action with BODY to be run after exiting Helm."
  (declare (doc-string 1))
  `(lambda ()
     (interactive)
     (with-helm-alive-p
       (helm-exit-and-execute-action (lambda (_candidate) ,@body)))))

  (defun helm-brain--add-children (_c)
    (dolist (candidate (helm-marked-candidates))
      (org-brain-add-relationship
       (org-brain-entry-at-pt) (or (org-brain-entry-from-id candidate) candidate)))
    (org-brain--revert-if-visualizing))

  (defun helm-brain--add-parents (_c)
    (dolist (candidate (helm-marked-candidates))
      (org-brain-add-relationship
       (or (org-brain-entry-from-id candidate) candidate) (org-brain-entry-at-pt)))
    (org-brain--revert-if-visualizing))

  (defun helm-brain--add-friends (_c)
    (dolist (candidate (helm-marked-candidates))
      (org-brain--internal-add-friendship
       (org-brain-entry-at-pt) (or (org-brain-entry-from-id candidate) candidate)))
    (org-brain--revert-if-visualizing))

  (defun helm-brain--delete-entries (_c)
    (dolist (candidate (helm-marked-candidates))
      (org-brain-delete-entry (or (org-brain-entry-from-id candidate) candidate))))

  (defun helm-brain--archive (_c)
    (dolist (candidate (helm-marked-candidates))
      (org-brain-archive (or (org-brain-entry-from-id candidate) candidate))))

  (defun helm-brain--select (_c)
    (dolist (candidate (helm-marked-candidates))
      (org-brain-select (or (org-brain-entry-from-id candidate) candidate) 1)))

  (defun helm-brain--unselect (_c)
    (dolist (candidate (helm-marked-candidates))
      (org-brain-select (or (org-brain-entry-from-id candidate) candidate) -1)))

(defun helm-org-brain--visualize-node (_c)
  (dolist (candidate (helm-marked-candidates))
    (org-brain-visualize (or (org-brain-entry-from-id candidate) candidate))))

(defun helm-org-brain--switch-node (_c)
  (dolist (candidate (helm-marked-candidates))
    (org-brain-goto (or (org-brain-entry-from-id candidate) candidate))))

(defun helm-org-brain-switch-node-other-window ()
  "Open the current node selected in helm-brain in org"
  (interactive)
  (with-helm-alive-p
    (helm-exit-and-execute-action 'helm-org-brain--switch-node)))

(defvar helm-org-brain-map
  (let ((map (make-sparse-keymap)))
    (set-keymap-parent map helm-map)
    ;; (define-key map (kbd "C-c o") (helm-exit-and-run! (helm-org-brain--switch-node)))
    (define-key map (kbd "C-c o") 'helm-org-brain-switch-node-other-window)
    map)
  "Keymap for `helm-brain'.")

(defun helm-org-brain-build-source (&optional filter)
  "Build source for org-brain buffers.
See `helm-org-brain' for more details."
  (helm-build-sync-source "org-brain"
    :candidates #'org-brain--all-targets
    ;; :candidate-transformer 'helm-exwm-highlight-buffers
    :action '(("Visualize" . (lambda (x)
                   (org-brain-visualize (or (org-brain-entry-from-id x) x))))
              ;; ("Visualize node" . helm-org-brain--visualize-node)
              ("Switch to node(s) in other window `C-c o`'" . helm-org-brain--switch-node)
              ("Kill buffer(s) `M-D`" . helm-kill-marked-buffers))
    ;; When follow-mode is on, the persistent-action allows for multiple candidate selection.
    :persistent-action 'helm-buffers-list-persistent-action
    :keymap helm-org-brain-map))

  (defvar helm-org-brain--fallback-source
    (helm-make-source "New entry" 'helm-source-dummy
      :action (helm-make-actions
               "Visualize" (lambda (x)
                             (org-brain-visualize (org-brain-get-entry-from-title x)))
               "Add children" 'helm-brain--add-children
               "Add parents" 'helm-brain--add-parents
               "Add friends" 'helm-brain--add-friends)))

;; (defun helm-org-brain (&optional filter)
(defun helm-org-brain ()
  (interactive)
  (helm :sources (helm-org-brain-build-source helm-brain--fallback-source)
        :buffer "helm-org-brain"))
#+end_src

Maybe also have a function to rifle the visualized node? [[https://github.com/justin-roche/spacemacs-config/blob/69dd0703e0a331b84cada2a13a145419460c3db1/org-journal.el#L119][inspiration]]
#+begin_src elisp
;; (defun helm-org-rifle-brain ()
;;   ;; "Rifle files in `org-brain-path'.\"
;;   (interactive)
;;   (helm-org-rifle-directories (list org-brain-path)))

#+end_src

