.doom.d/modules/lang/org-private/config.el

  (load! "+helm-org-brain")

  :config
;; (map! :map helm-org-brain-map
;;         "C-c o" #'helm-org-brain-switch-node-other-window)

  (map! :map org-mode-map
      ;; "C-c a"         #'org-agenda
       (:prefix ("C-c b" . "brain")
        "a"            #'org-brain-agenda
        "v"            #'org-brain-visualize)))

;; (defun helm-org-rifle-brain ()
;;   ;; "Rifle files in `org-brain-path'.\"
;;   (interactive)
;;   (helm-org-rifle-directories (list org-brain-path)))


;; org-noter
