.doom.d/modules/lang/org-private/config.el
;; org-noter + org-brain
;; https://github.com/Kungsgeten/org-brain#org-noter
(add-hook 'org-noter-insert-heading-hook #'org-id-get-create)
(defun org-brain-open-org-noter (entry)
  "Open `org-noter' on the ENTRY. If run interactively, get ENTRY from context."
  (interactive (list (org-brain-entry-at-pt)))
  (org-with-point-at (org-brain-entry-marker entry)
    (org-noter)))

;;    (define-key org-brain-visualize-mode-map (kbd "\C-c n") 'org-brain-open-org-noter)
(map! :map org-brain-visualize-mode-map "\C-c n" #'org-brain-open-org-noter)

;; org-pomodoro
(use-package! org-pomodoro
  :after org
  :config
  (setq org-pomodoro-keep-killed-pomodoro-time t))

;; (use-package! org-drill
;;   :after org
;;   :config
;;   (setq org-drill-scope (quote directory)))

;; (org-drill "~/org/article-notes/article-index.org")

(use-package! org-noter
  :after org
  :config
  ;; Your org-noter config ........
  (require 'org-noter-pdftools)
  (setq org-noter-notes-search-path '("~/org/org-brain/article-notes/")))

(use-package! org-pdftools
  :hook (org-mode . org-pdftools-setup-link))

(use-package! org-noter-pdftools
  :after org-noter
  :config
  (setq org-noter-pdftools-insert-content-heading nil)
  (setq org-noter-pdftools-use-org-id nil) ;; this interferes with org-brain
  ;; Add a function to ensure precise note is inserted
  (defun org-noter-pdftools-insert-precise-note (&optional toggle-no-questions)
    (interactive "P")
    (org-noter--with-valid-session
     (let ((org-noter-insert-note-no-questions (if toggle-no-questions
                                                   (not org-noter-insert-note-no-questions)
                                                 org-noter-insert-note-no-questions))
           (org-pdftools-use-isearch-link t)
           (org-pdftools-use-freestyle-annot t))
       (org-noter-insert-note (org-noter--get-precise-info)))))

  ;; fix https://github.com/weirdNox/org-noter/pull/93/commits/f8349ae7575e599f375de1be6be2d0d5de4e6cbf
  (defun org-noter-set-start-location (&optional arg)
    "When opening a session with this document, go to the current location.
With a prefix ARG, remove start location."
    (interactive "P")
    (org-noter--with-valid-session
     (let ((inhibit-read-only t)
           (ast (org-noter--parse-root))
           (location (org-noter--doc-approx-location (when (called-interactively-p 'any) 'interactive))))
       (with-current-buffer (org-noter--session-notes-buffer session)
         (org-with-wide-buffer
          (goto-char (org-element-property :begin ast))
          (if arg
              (org-entry-delete nil org-noter-property-note-location)
            (org-entry-put nil org-noter-property-note-location
                           (org-noter--pretty-print-location location))))))))
  (with-eval-after-load 'pdf-annot
    (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note)))

(load! "+ir.el")

(use-package! org-web-tools)
(use-package! org-web-tools-archive)

;; (use-package! org-gcal
;;   :after org
;;   :init
;;   ;; Currently not working https://github.com/kidd/org-gcal.el/issues/58
;;   ;; https://console.cloud.google.com/apis/credentials/
;;   (setq org-gcal-client-id (password-store-get "secrets/org-gcal-client-id")
;;         org-gcal-client-secret (password-store-get "secrets/org-gcal-client-secret"))

;;   (setq org-gcal-file-alist '(("otoo.danieru@gmail.com" . "~/org/danieru-cal.org"))))

(load! "+org-media-note.el")
(load! "+org-protocol.el")
