emacs-configuration.org
** PROJECT Literate programming hydra
:PROPERTIES:
:CREATED:  [2020-10-24 Sat 00:16]
:ID:       10d9b8ea-2886-4c67-a7ef-5d66994dab6b
:END:
Create a hydra menu for insertion of src block options:

#+name: hydra babel lang
#+begin_src elisp
(defhydra hydra-org-src (:color blue :hint nil)
  "
_c_onfig   _e_macs-lisp _p_ython
_C_lojure  _l_isp       _s_hell
C_#_       _L_atex      _S_cheme
 "

  ("c" (insert "conf"))
  ("C" (insert "clojure"))
  ("#" (insert "csharp"))
  ("e" (insert "elisp"))
  ("l" (insert "lisp"))
  ("L" (insert "latex"))
  ("p" (insert "python"))
  ("s" (insert "sh"))
  ("S" (insert "scheme"))
  ("o" nil "quit"))
#+end_src

#+RESULTS:
: hydra-org-src/body

Using the official hydra [[https://github.com/abo-abo/hydra/wiki/Nesting-Hydras][wiki]] we'll make a hydra to insert org-babel header-args and reveal their respective options in nested hydra. This should be independent of src block expansion so that it can be reused in yasnippets pertaining to subtree :PROPERTIES:.

First we'll define some hydra body - initially the base hydra:

(after some testing I needed a function for inserting /after/ the cursor position, otherwise text gets cut up when pasting programmatically with default internals)
#+name: insertion after point
#+begin_src elisp
(defun insert-after-point (n)
  (forward-char)
  (insert n))
#+end_src

I should actually write a function that intelligently finds the src-block header and moves point there with =save-excursion=:
#+name: intelligent block finder
#+begin_src elisp
(defun org-babel-toggle-header-args (arg)
"Toggle insertion of header-args"
(interactive)
(save-excursion
  (org-babel-goto-src-block-head)
  (goto-char (point-at-eol))
  ;; (s-matches-p (rx (seq (arg))))
  (when (s-matches-p arg arg)
      (message "error")
      ;; we'll have to match the arg via regex then remove if there.
    (insert arg))))
#+end_src

#+RESULTS: intelligent block finder
: org-babel-toggle-header-args

#+BEGIN_SRC elisp
(org-babel-toggle-header-args ":cache")
#+END_SRC

#+RESULTS:
: error

#+BEGIN_SRC elisp
(defhydra hydra-test (:color teal :hint nil)
  "
   header-args
----------------
_t_ ?t? :test _l_ ?l? :lol

"
  ("t" (message "%s" (hydra-get-property 'hydra-curr-body-fn ':test)))
  ("l" (message "%s" (symbol-value 'hydra-curr-on-exit)))
  ;; ("l" (message "%s" (symbol-value 'hydra-curr-body-fn)))
  )
#+END_SRC

#+RESULTS:
: hydra-test/body

#+BEGIN_SRC elisp
(defhydra hydra-test2 (:color blue)
  ("q" nil "quit" :column "ROFL")
  ("t" (message "%s" (hydra-get-property 'hydra-curr-body-fn)) "_t_rekker")
  ("l" (message "%s" (pretty-hydra--get-heads 'hydra-curr-body-fn)) "big jol" :column "hallo")
  )
#+END_SRC

#+RESULTS:
: hydra-test2/body

hydra-curr-body-fn

#+begin_src elisp
(defun symbol-navigation-hydra-head-header (is-enabled name suffix)
  "Get the string for the head.
`IS-ENABLED' should be a boolean. `NAME' should be the name of the head.
`SUFFIX' should be the string to append to the header, either the empty
string or a string indicating that `NAME' is disabled."
  (if is-enabled
      (format "%s%s" name suffix)
    (format "%s%s"
            (propertize name 'face symbol-navigation-hydra-disabled-head-face)
            suffix)))
#+end_src

A collection of good looking tangle functions.
#+begin_src elisp
;; (org-babel-src-block-regexp)
;; org-babel-key-bindings
;; org-babel-header-arg-names

(org-babel-check-src-block)
(org-babel-when-in-src-block)
(org-babel-goto-src-block-head)
(org-babel-get-src-block-info)
(org-element-inline-src-block-interpreter)
(org-element-src-block-parser)
(org-babel-enter-header-arg-w-completion)
(org-babel-ref-parse)
(org-babel-find-file-noselect-refresh)
(org-babel-tangle-jump-to-org)
(org-babel--get-vars)
(org-babel-parse-multiple-vars)
(org-babel-do-load-languages)
(org-babel-noweb-wrap)
(org-babel-speed-command-activate)
(org-babel-params-from-properties)
(org-babel-read-element)
(org-babel-tangle-single-block)
(org-babel-process-params)
(org-babel-header-arg-expand)
(org-babel-insert-header-arg)
#+end_src

#+begin_src elisp :noweb-ref header-args-hydra
(defhydra hydra-src-header-args (:color teal :hint nil)
  "
   header-args
----------------
:_c_ache    :_f_ile       :_n_oweb      :_s_ep         [_#_]:comments
:_C_mdline  :_F_ile-desc  :_noweb-_r_ef :_s_ession     [_|_]:colnames
:_d_ir      :_h_lines     :_N_oweb-sep  :_t_angle      [_-_]:rownames
:_e_val     :_m_kdirp     :_p_adline    :_T_angle-mode [_!_]:shebang
:_E_xports  :no-e_x_pand  :_P_ost       :_v_ar         [_&_]:epi/pro
                          :_R_esults    :_w_rap        [_q_] quit

"
  ("c" (progn
         (insert-after-point " :cache")
         (hydra-cache-options/body)))
  ("C" (progn
         (insert-after-point " :cmdline ")
         (edit-indirect-region (point) (point) 't)
         (sh-mode)
         (hydra-cache-options/body)))
  ("d" (progn
         (insert-after-point " :dir ")
;; TODO build in somekind of autocompletion
         (hydra-dir-options/body)))
  ;; ("e")
  ;; ("E")
  ;; ("f")
  ;; ("F")
  ;; ("h")
  ;; ("m")
  ;; ("x")
  ;; ("n")
  ;; ("r")
  ;; ("N")
  ;; ("p")
  ;; ("P")
  ;; ("R")
  ;; ("s")
  ;; ("s")
  ;; ("t")
  ;; ("T")
  ;; ("v")
  ;; ("w")
  ;; ("#")
  ("|" (progn
         (insert-after-point " :colnames")
         (hydra-cache-options/body)))
  ;; ("-")
  ;; ("!")
  ;; ("&")
  ("q" hydra-pop)
  )
#+end_src

#+RESULTS:
: hydra-src-header-args/body

Then the subsequent nested hydra, in alphabetical order
#+begin_src elisp :noweb-ref header-args-options
(defhydra hydra-cache-options (:color teal)
  "
    :cache options
----------------------
:cache [_n_] no (default)
:cache [_y_] yes

[_b_] back
"
  ("n" (progn
         (insert-after-point " no")
         (hydra-src-header-args/body)))
  ("y" (progn
         (insert-after-point " yes")
         (hydra-src-header-args/body)))
  ("b" (hydra-src-header-args/body)))


(defhydra hydra-colnames-options (:color teal)
  "
    :colnames options
----------------------
:colnames [_n_] no (Elisp default)
:colnames [_y_] yes (1st row are colnames)
:colnames [_l_] <LIST>
:colnames [_'_] '() [Unsets header arg]

[_b_] back
"
  ("n" (progn
         (insert-after-point " no")
         (hydra-src-header-args/body)))
  ("y" (progn
         (insert-after-point " yes")
         (hydra-src-header-args/body)))
  ("l" (progn
         (insert-after-point " ")
         (edit-indirect-region (point) (point) 't)
         (hydra-src-header-args/body)))
  ("'" (progn
         (insert-after-point "'()")
         (hydra-src-header-args/body)))
  ("b" (hydra-src-header-args/body)))

(defhydra hydra-comments-options (:color teal)
  "
    :comments options
----------------------
:comments [_n_] no (default)
:comments [_l_] link
:comments [_y_] yes (deprecated)
:comments [_N_] noweb (advanced 'link')
:comments [_o_] org (Insert preceding org text as plain comments)
:comments [_b_] both (Turn on both 'link' and 'org')

[_b_] back
"
  ("n" (progn
         (insert-after-point " no")
         (hydra-src-header-args/body)))
  ("l" (progn
         (insert-after-point " link")
         (hydra-src-header-args/body)))
  ("y" (progn
         (message "Warning: ':comments yes' (deprecated) - same as ':comments link'")
         (hydra-comments-options/body)))
  ("N" (progn
         (insert-after-point " noweb")
         (hydra-src-header-args/body)))
  ("o" (progn
         (insert-after-point " org")
         (hydra-src-header-args/body)))
  ("b" (progn
         (insert-after-point " both")
         (hydra-src-header-args/body)))
  ("b" (hydra-src-header-args/body)))
#+end_src

#+begin_src elisp
(completing-read '(helm-find-files-1))
(completing-read)
#+end_src

I need to have helm-find-files or another helm source for return the directory path selected and insert it into the buffer.

Define a new helm?

#+begin_src elisp
(setq helm-dir-source
      '((name . "Select SRC block :dir")
        (candidates . helm-source-find-files)
        (action . (lambda (candidate)
                    (message "%s" candidate)))))

;; (defun helm-insert-dir ()
;;   (interactive)
;;   (insert 'identity
;;           (helm :sources '(helm-dir-source)))
;;   )
#+end_src

#+begin_src elisp
(helm :sources '(helm-dir-source))
#+end_src

#+begin_src elisp
(defhydra hydra-dir-options (:color teal)
  "
    :dir options
----------------------
:dir [_p_] projectile (default)

[_b_] back
"
("n" (progn
       (insert-after-point " no")
       (hydra-src-header-args/body)))
("y" (progn
       (insert-after-point " yes")
       (hydra-src-header-args/body)))
("b" (hydra-src-header-args/body)))
#+end_src

The =hydra-push/pop= machinery, which will allow us to leave hydras and enter nests?:

#+name: hydra push/pop
#+begin_src elisp
(defvar hydra-stack nil)

(defun hydra-push (expr)
  (push `(lambda () ,expr) hydra-stack))

(defun hydra-pop ()
  (interactive)
  (let ((x (pop hydra-stack)))
    (when x
      (funcall x))))
#+end_src

#+RESULTS:
: hydra-pop

Should we also manage some evil bindings for org-babel?
Another option would be to writing a function binding it to something like <enter>, and having a helm or hydra pop up for moving to the src_block of a given <<noweb>> reference:
1. Jump to src_block
2. Open in indirect buffer
3. Open in =org-edit-special= buffer

#+begin_src elisp :tangle ~/.doom.d/modules/lang/org-private/+hydra.el
<<header-args options>>
<<header-args hydra>>
<<hydra push/pop>>
#+end_src

**** Misc:
:PROPERTIES:
:CREATED:  [2020-10-24 Sat 00:16]
:ID:       ac4349b2-2c8d-463d-a9a7-3e1ce0fd2b47
:END:

This is just an example helm src block.
#+begin_src elisp :results silent
 (defhydra hydra-org-template (:color blue :hint nil)
    "
 _c_enter  _q_uote     _e_macs-lisp    _L_aTeX:
 _l_atex   _E_xample   _p_erl          _i_ndex:
 _a_scii   _v_erse     _P_erl tangled  _I_NCLUDE:
 _s_rc     _n_ote      plant_u_ml      _H_TML:
 _h_tml    ^ ^         ^ ^             _A_SCII:
"
    ("s" (hot-expand "<s"))
    ("E" (hot-expand "<e"))
    ("q" (hot-expand "<q"))
    ("v" (hot-expand "<v"))
    ("n" (hot-expand "<not"))
    ("c" (hot-expand "<c"))
    ("l" (hot-expand "<l"))
    ("h" (hot-expand "<h"))
    ("a" (hot-expand "<a"))
    ("L" (hot-expand "<L"))
    ("i" (hot-expand "<i"))
    ("e" (hot-expand "<s" "emacs-lisp"))
    ("p" (hot-expand "<s" "perl"))
    ("u" (hot-expand "<s" "plantuml :file CHANGE.png"))
    ("P" (hot-expand "<s" "perl" ":results output :exports both :shebang \"#!/usr/bin/env perl\"\n"))
    ("I" (hot-expand "<I"))
    ("H" (hot-expand "<H"))
    ("A" (hot-expand "<A"))
    ("<" self-insert-command "ins")
    ("o" nil "quit"))

  (require 'org-tempo) ; Required from org 9 onwards for old template expansion
  ;; Reset the org-template expnsion system, this is need after upgrading to org 9 for some reason
  (setq org-structure-template-alist (eval (car (get 'org-structure-template-alist 'standard-value))))
  (defun hot-expand (str &optional mod header)
    "Expand org template.

STR is a structure template string recognised by org like <s. MOD is a
string with additional parameters to add the begin line of the
structure element. HEADER string includes more parameters that are
prepended to the element after the #+HEADER: tag."
    (let (text)
      (when (region-active-p)
        (setq text (buffer-substring (region-beginning) (region-end)))
        (delete-region (region-beginning) (region-end))
        (deactivate-mark))
      (when header (insert "#+HEADER: " header) (forward-line))
      (insert str)
      (org-tempo-complete-tag)
      (when mod (insert mod) (forward-line))
      (when text (insert text))))

  (define-key org-mode-map "<"
    (lambda () (interactive)
      (if (or (region-active-p) (looking-back "^"))
          (hydra-org-template/body)
        (self-insert-command 1))))

  (eval-after-load "org"
    '(cl-pushnew
    '("not" . "note")
      org-structure-template-alist))

#+end_src

** PROJECT Incremental literate programming
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 11:00]
:ID:       f0cdfd96-d9e7-450e-8b36-9ac3c37c7513
:END:
*** WAITING Setup incremental programming with ~org-incremental~
:PROPERTIES:
:TRIGGER:  chain-find-next(NEXT,from-current,priority-up,effort-down)
:CREATED:  [2022-02-12 Sat 11:00]
:ID:       5bc47138-536f-4860-920d-1ed08274dd52
:END:
:LOGBOOK:
- State "WAITING"    from              [2022-02-12 Sat 10:59] \\
  Complete org-incremental package
:END:

* EXWM
:PROPERTIES:
:CREATED:  [2020-11-16 Mon 18:45]
:ID:       d263ee0b-c782-4e59-9d52-2cf70d96cfba
:header-args:elisp: :mkdirp yes :noweb yes
:END:

** packages
:PROPERTIES:
:CREATED:  [2021-08-28 Sat 17:12]
:ID:       70d8041b-2689-4d8d-b127-c1fae8285eaf
:END:
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/packages.el
;; -*- no-byte-compile: t; -*-
;;; desktop/exwm/packages.el

(package! xelb)
  ;; :recipe (:host github :repo "ch11ng/xelb"))
(package! exwm)
  ;; :recipe (:host github :repo "ch11ng/exwm"))
(package! dbc)
(package! exwm-edit)
(package! dmenu)
(package! posframe)
(package! hydra-posframe :recipe
  (:host github
   :repo "Ladicle/hydra-posframe"))
;; (package! helm-posframe)
;; (package! ivy-posframe)
(package! ace-link)
(package! helm-exwm)
(package! helm-org-rifle)
(package! pulseaudio-control)
(package! desktop-environment)
(package! scrot.el :recipe
  (:host github
   :repo "dakra/scrot.el"
   :files ("*")))
(package! switch-window)
(package! helm-unicode)
(package! exwm-firefox-core)
(package! exwm-firefox-evil)
#+end_src

** Minimal starting
:PROPERTIES:
:CREATED:  [2020-12-03 Thu 11:03]
:ID:       35c06fd8-f238-4af1-aa4c-75351aab9065
:END:
#+BEGIN_SRC elisp :noweb yes :tangle ~/.doom.d/modules/desktop/exwm/config.el
;;; desktop/exwm/config.el -*- lexical-binding: t; -*-
(load! "+funcs")
(use-package! xelb)
(use-package! exwm
  :init
  (add-hook 'exwm-mode-hook #'doom-mark-buffer-as-real-h)
  (set-popup-rule! "^\\*EXWM\\*$" :ignore t)

  (load! "+desktop")
  ;; (load! "+polybar")
  (setq exwm-workspace-number 7)
  ;;    (when exwm-hide-tiling-modeline
                                        ;(add-hook 'exwm-mode-hook #'hidden-mode-line-mode))
  (setq exwm-input-line-mode-passthrough t)

  (load! "+settings")

  (use-package! ibus
    :config
    (add-hook! 'after-init-hook 'ibus-mode-on)
    (setq ibus-agent-file-name "/home/nanjigen/.emacs.d/.local/straight/repos/ibus/ibus-el-agent"))

  <<exwm main>>

  <<exwm buffer management>>

  <<exwm keybinds>>

  <<exwm-edit>>

  (exwm-enable))
#+END_SRC

