emacs-configuration.org
*** TODO Desktop specific functions
:PROPERTIES:
:CREATED:  [2022-02-11 Fri 14:36]
:ID:       7c701453-43c5-42fe-8920-9341afef0efa
:END:
System and desktop controls, from Emacs/EXWM
#+BEGIN_SRC elisp :noweb-ref exwm keybinds
(use-package! desktop-environment
    :after exwm
    :config (desktop-environment-mode)
    :custom
    (desktop-environment-brightness-small-increment "2%+")
    (desktop-environment-brightness-small-decrement "2%-")
    (desktop-environment-brightness-normal-increment "5%+")
    (desktop-environment-brightness-normal-decrement "5%-"))

(exwm-input-set-key (kbd "s--") #'desktop-environment-volume-decrement)
(exwm-input-set-key (kbd "s-=") #'desktop-environment-volume-increment-slowly)
(exwm-input-set-key (kbd "s-0") #'desktop-environment-toggle-mute)
(exwm-input-set-key (kbd "<XF86AudioMute>") #'desktop-environment-toggle-mute)
(exwm-input-set-key (kbd "<XF86AudioLowerVolume>") #'desktop-environment-volume-decrement)
(exwm-input-set-key (kbd "<XF86AudioRaiseVolume>") #'desktop-environment-volume-increment-slowly)
(exwm-input-set-key (kbd "<XF86AudioPrev>") #'desktop-environment-music-previous)
(exwm-input-set-key (kbd "<XF86AudioNext>") #'desktop-environment-music-next)
(exwm-input-set-key (kbd "<XF86AudioStop>") #'desktop-environment-music-stop)
(exwm-input-set-key (kbd "<XF86AudioPlay>") #'desktop-environment-toggle-music)
(exwm-input-set-key (kbd "<XF86MonBrightnessDown>") #'desktop-environment-brightness-decrement)
(exwm-input-set-key (kbd "<XF86MonBrightnessUp>") #'desktop-environment-brightness-increment)
;;   (use-package xbacklight
;; :bind (("<XF86MonBrightnessUp>" . xbacklight-increase)
;;        ("<XF86MonBrightnessDown>" . xbacklight-decrease)))

#+END_SRC

#+BEGIN_SRC elisp :noweb-ref exwm keybinds
(defun nanjigen/lockscreen ()
  (interactive)
  "simple shell call for locking screen"
  ;; TODO This needs to be changed to use i3lock
  (shell-command "betterlockscreen -l --display 1"))

;; TODO pretty-hydra icons
;; (defvar logoff-menu--title (with-faicon ))

(pretty-hydra-define logoff-menu (:foreign-keys warn :title "logoff" :color blue :quit-key "q")
  ("Actions"
   (("l" nanjigen/lockscreen "lock computer")
    ("s" nanjigen/shutdown "shutdown computer")
    ("m" nanjigen/restart "restart computer")
    ("Q" save-buffers-kill-terminal "exit Emacs and logout"))))

  (exwm-input-set-key (kbd "s-x") #'logoff-menu/body)

#+END_SRC

#+BEGIN_SRC elisp :noweb-ref exwm keybinds
  ;; Pop ups
  (exwm-input-set-key (kbd "s-\\") #'helm-org-brain)
  (exwm-input-set-key (kbd "s-?") #'helm-org-rifle)
  (exwm-input-set-key (kbd "s-|") #'helm-bibtex)
  (exwm-input-set-key (kbd "s-u") #'+eshell/toggle)
  (exwm-input-set-key (kbd "s-`") #'+popup/toggle)
  (exwm-input-set-key (kbd "s-;") #'+popup-toggle-brain)
  ;; Change buffers
  (exwm-input-set-key (kbd "s-b") #'helm-mini) ;; try excluding EXWM buffers
  (exwm-input-set-key (kbd "s-B") #'helm-exwm)
#+END_SRC

*** Window and buffer manipulation
:PROPERTIES:
:CREATED:  [2022-02-11 Fri 14:36]
:ID:       e5335d6f-5423-4694-8847-a363d2daa9c2
:END:

(should this subtree be promoted? Window management is sort of the main point of ~EXWM~)
#+BEGIN_SRC elisp :noweb-ref exwm keybinds
  ;; Focusing windows
  (exwm-input-set-key (kbd "s-h") #'evil-window-left)
  (exwm-input-set-key (kbd "s-j") #'evil-window-down)
  (exwm-input-set-key (kbd "s-k") #'evil-window-up)
  (exwm-input-set-key (kbd "s-l") #'evil-window-right)
  (exwm-input-set-key (kbd "s-\/") #'split-window-below)
  (exwm-input-set-key (kbd "s-<return>") #'split-window-right)
  ;; Moving Windows
  (exwm-input-set-key (kbd "s-H") #'evil-window-move-far-left)
  (exwm-input-set-key (kbd "s-J") #'evil-window-move-very-bottom)
  (exwm-input-set-key (kbd "s-K") #'evil-window-move-very-top)
  (exwm-input-set-key (kbd "s-L") #'evil-window-move-far-right)
  ;; Resize
  (exwm-input-set-key (kbd "s-Y") #'enlarge-window-horizontally)
  (exwm-input-set-key (kbd "s-U") #'shrink-window)
  (exwm-input-set-key (kbd "s-I") #'enlarge-window)
  (exwm-input-set-key (kbd "s-O") #'shrink-window-horizontally)

#+END_SRC

#+BEGIN_SRC elisp :noweb-ref exwm keybinds
(use-package! switch-window
  :after exwm
  (setq switch-window-input-style 'minibuffer
        switch-window-shortcut-style 'qwerty))

#+END_SRC

#+BEGIN_SRC elisp :noweb-ref exwm keybinds
(defun nanjigen/min-max ()
  (interactive)
  (if (< 1 (count-windows))
      (doom/window-maximize-buffer)
    (winner-undo)))

(exwm-input-set-key (kbd "s-f") #'nanjigen/min-max)


;; Workspaces
(exwm-input-set-key (kbd "s-]") #'next-buffer)
(exwm-input-set-key (kbd "s-[") #'previous-buffer)

(exwm-input-set-key (kbd "s-'") #'helm-bookmarks)
;; (exwm-input-set-key (kbd "s-i") #'exwm-edit--compose)
#+END_SRC

*** TODO Window tree-style jumping
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 10:10]
:ID:       1a98a340-850c-4feb-a0f5-2e8aeb04c832
:END:
https://github.com/abo-abo/hydra/wiki/Window-Management#deluxe-window-moving
https://github.com/dimitri/switch-window#switch-window-seem-to-conflict-with-exwm-how-to-do

At first a function that calls something like ~ace-window~ or ~switch-window~ when opening a file from certain selection buffers:

#+BEGIN_SRC elisp :noweb-ref exwm keybinds :noweb no :results none
;; Window management
  (use-package! ace-window
    :init
    (setq ace-window-display-mode t))

#+END_SRC

*** TODO Review and delete/archive
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 10:22]
:ID:       f1d923d9-bad4-4c86-aaaf-527cad1cc2b9
:END:

Extra helm stuff
#+begin_src elisp :noweb no
  ;; (exwm-input-set-key (kbd "s-\\") #'exwm/multi-org-brain-helm)

  ;; (defun exwm/helm-org-rifle-gtd ()
  ;;   "A rifle for my gtd files"
  ;;   (interactive)
  ;;   (helm-org-rifle-files (list "~/org/personal.org"
  ;;                               "~/org/work.org"
  ;;                               "~/org/inbox.org"
  ;;                               "~/org/someday.org")))
#+end_src

I'm not actually making use of prefix keys but keep them here as a reference
#+BEGIN_SRC elisp
(setq exwm-input-prefix-keys
      '(?\C-x
        ?\M-x
        ?\M-m
        ?\C-g
        ?\C-m
        ?\C-h
        ?\C-р                         ; cyrillic
        ))
#+END_SRC
