.doom.d/modules/desktop/exwm/config.el
  (use-package! desktop-environment
      :after exwm
      :config (desktop-environment-mode)
      :custom
      (desktop-environment-brightness-small-increment "2%+")
      (desktop-environment-brightness-small-decrement "2%-")
      (desktop-environment-brightness-normal-increment "5%+")
      (desktop-environment-brightness-normal-decrement "5%-"))
  
  (exwm-input-set-key (kbd "s--") #'desktop-environment-volume-decrement)
  (exwm-input-set-key (kbd "s-=") #'desktop-environment-volume-increment-slowly)
  (exwm-input-set-key (kbd "s-0") #'desktop-environment-toggle-mute)
  (exwm-input-set-key (kbd "<XF86AudioMute>") #'desktop-environment-toggle-mute)
  (exwm-input-set-key (kbd "<XF86AudioLowerVolume>") #'desktop-environment-volume-decrement)
  (exwm-input-set-key (kbd "<XF86AudioRaiseVolume>") #'desktop-environment-volume-increment-slowly)
  (exwm-input-set-key (kbd "<XF86AudioPrev>") #'desktop-environment-music-previous)
  (exwm-input-set-key (kbd "<XF86AudioNext>") #'desktop-environment-music-next)
  (exwm-input-set-key (kbd "<XF86AudioStop>") #'desktop-environment-music-stop)
  (exwm-input-set-key (kbd "<XF86AudioPlay>") #'desktop-environment-toggle-music)
  (exwm-input-set-key (kbd "<XF86MonBrightnessDown>") #'desktop-environment-brightness-decrement)
  (exwm-input-set-key (kbd "<XF86MonBrightnessUp>") #'desktop-environment-brightness-increment)
  ;;   (use-package xbacklight
  ;; :bind (("<XF86MonBrightnessUp>" . xbacklight-increase)
  ;;        ("<XF86MonBrightnessDown>" . xbacklight-decrease)))
  
    ;; Pop ups
    ;; (exwm-input-set-key (kbd "s-\\") #'helm-org-brain)
    (exwm-input-set-key (kbd "s-?") #'helm-org-rifle)
    (exwm-input-set-key (kbd "s-|") #'consult-bibtex)
    (exwm-input-set-key (kbd "s-u") #'+eshell/toggle)
    (exwm-input-set-key (kbd "s-`") #'+popup/toggle)
    (exwm-input-set-key (kbd "s-;") #'+popup-toggle-brain)
    ;; Change buffers
    (exwm-input-set-key (kbd "s-b") #'consult-buffer) ;; try excluding EXWM buffers
    ;; (exwm-input-set-key (kbd "s-B") #'helm-exwm)
  (defun nanjigen/lockscreen ()
    (interactive)
    "simple shell call for locking screen"
    ;; TODO This needs to be changed to use i3lock
    (shell-command "betterlockscreen -l --display 1"))
  
  ;; TODO pretty-hydra icons
  ;; (defvar logoff-menu--title (with-faicon ))
  
  (pretty-hydra-define logoff-menu (:foreign-keys warn :title "logoff" :color blue :quit-key "q")
    ("Actions"
     (("l" nanjigen/lockscreen "lock computer")
      ("s" nanjigen/shutdown "shutdown computer")
      ("m" nanjigen/restart "restart computer")
      ("Q" save-buffers-kill-terminal "exit Emacs and logout"))))
  
    (exwm-input-set-key (kbd "s-x") #'logoff-menu/body)
  
    ;; Pop ups
    (exwm-input-set-key (kbd "s-\\") #'helm-org-brain)
    (exwm-input-set-key (kbd "s-?") #'helm-org-rifle)
    (exwm-input-set-key (kbd "s-|") #'helm-bibtex)
    (exwm-input-set-key (kbd "s-u") #'+eshell/toggle)
    (exwm-input-set-key (kbd "s-`") #'+popup/toggle)
    (exwm-input-set-key (kbd "s-;") #'+popup-toggle-brain)
    ;; Change buffers
    (exwm-input-set-key (kbd "s-b") #'helm-mini) ;; try excluding EXWM buffers
    (exwm-input-set-key (kbd "s-B") #'helm-exwm)
    ;; Focusing windows
    (exwm-input-set-key (kbd "s-h") #'evil-window-left)
    (exwm-input-set-key (kbd "s-j") #'evil-window-down)
    (exwm-input-set-key (kbd "s-k") #'evil-window-up)
    (exwm-input-set-key (kbd "s-l") #'evil-window-right)
    (exwm-input-set-key (kbd "s-\/") #'split-window-below)
    (exwm-input-set-key (kbd "s-<return>") #'split-window-right)
    ;; Moving Windows
    (exwm-input-set-key (kbd "s-H") #'evil-window-move-far-left)
    (exwm-input-set-key (kbd "s-J") #'evil-window-move-very-bottom)
    (exwm-input-set-key (kbd "s-K") #'evil-window-move-very-top)
    (exwm-input-set-key (kbd "s-L") #'evil-window-move-far-right)
    ;; Resize
    (exwm-input-set-key (kbd "s-Y") #'enlarge-window-horizontally)
    (exwm-input-set-key (kbd "s-U") #'shrink-window)
    (exwm-input-set-key (kbd "s-I") #'enlarge-window)
    (exwm-input-set-key (kbd "s-O") #'shrink-window-horizontally)
  
  (use-package! switch-window
    :after exwm
    (setq switch-window-input-style 'minibuffer
          switch-window-shortcut-style 'qwerty))
  
  (defun nanjigen/min-max ()
    (interactive)
    (if (< 1 (count-windows))
        (doom/window-maximize-buffer)
      (winner-undo)))
  
  (exwm-input-set-key (kbd "s-f") #'nanjigen/min-max)
  
  
  ;; Workspaces
  (exwm-input-set-key (kbd "s-]") #'next-buffer)
  (exwm-input-set-key (kbd "s-[") #'previous-buffer)
  
  (exwm-input-set-key (kbd "s-'") #'helm-bookmarks)
  ;; (exwm-input-set-key (kbd "s-i") #'exwm-edit--compose)
  ;; Window management
    (use-package! ace-window
      :init
      (setq ace-window-display-mode t))
  

   (use-package! exwm-edit
     :after exwm
     :custom
