.doom.d/modules/desktop/exwm/config.el
     (exwm-edit-bind-default-keys nil)
  
     :config
     (defalias 'exwm-edit--display-buffer 'pop-to-buffer)
     (defun exwm/on-exwm-edit-compose ()
       ;; (spacemacs/toggle-visual-line-navigation-on)
       (funcall 'org-mode))
     ;; include frame height restrictions here?
     (add-hook 'exwm-edit-compose-hook 'exwm/on-exwm-edit-compose))

  (nanjigen/start-panel)

  (exwm-enable))
